{
  "henchmen": {
    "settings_1": {
                                                //  Изменяйте значения только в кавычках. Любые изменения вступят в силу только после перезапуска сценария.
                                                //  Общий опыт = боевой опыт + опыт, получаемый при повышении уровня героя + ежедневный опыт

                                                // Боевой опыт дается только тогда, когда ваш герой побеждает в бою с живым оруженосцем.
                                                //  Боевой опыт = battleExpStatic + battleExpRandom + (Полученный героем опыт)^0.5 * battleHeroExpCoef/100 + Уровень Героя * battleExpPerHeroLv
      "battleExpStatic":            "6",        //  Фиксированный опыт за каждый бой. По умолчанию = 6
      "battleExpRandom":            "4",        //  Максимальный случайный опыт за каждый бой. По умолчанию = 4
      "battleHeroExpCoef":          "5",        //  Pпроцент квадратного корня из боевого опыта, полученного героем. По умолчанию = 5
      "battleExpPerHeroLv":         "0",        //  Опыт, получаемый за уровень героя. По умолчанию = 0
      "battleExpMin":               "0",        //  Минимальный опыт за каждый бой. По умолчанию = 0
      "battleExpMax":               "1000",     //  Максимальный опыт за каждый бой. Default = 1000

                                                //  Повышение уровня героя или прохождение дня даёт вашему оруженосцу некоторое количество опыта.
      "bonusHeroLvUp":              "10",       //  Опыт, полученный при повышении уровня героя. По умолчанию = 10
      "bonusDaily":                 "1",        //  Ежедневный опыт. По умолчанию = 1

                                                //  Опыт отряда полностью отличается от опыта боя. Это влияет только на бонусы отряда к опыту.
                                                //  Суммарный опыт = боевой опыт героя
      "stackExpEnabled":            "TRUE",     //  Включение / отключение опыта отряда оруженосца. По умолчанию = TRUE
      "stackExpTroopMode":          "TRUE",     //  Опыт стека Хенчмена одинаково работает с войсками. Это означает, что когда вы выбираете нового приспешника, он получает стек опыта от выбранного существа. Кроме того, теперь приспешник теряет весь стек опыта и знамя, если его убивают на поле боя. По умолчанию = TRUE
      "bannerEnabled":              "TRUE",     //  Включение / отключение знамени полководца. Щелкните правой кнопкой мыши цветной флаг на экране героя для настройки. По умолчанию = TRUE
      "bannerFree":                 "FALSE",    //  Оруженосец начинает с экипированным знаменем. По умолчанию = FALSE

                                                //  Улучшение Заклинаний (0 - отключено)
      "bonusSpellDmgPerPwr":        "10",       //  Дополнительный урон от заклинаний за каждую "силу". По умолчанию = 10
      "moreSpellEveryXKnl":         "30",       //  Требования к знаниям для одного дополнительного заклинания. По умолчанию = 30

                                                //  Твики
      "battleExpLossPct":           "0",        //  Процент потери боевого опыта при выборе нового оруженосца. По умолчанию = 0
      "battleExpAIPct":             "100",      //  Процент получения боевого опыта для приспешников ИИ. По умолчанию 100
      "returnToArmy":               "TRUE",     //  Возвращение оруженосца в армию при выборе нового. По умолчанию = TRUE
      "altExpPerLv":                "TRUE",     //  Альтернативные требования к опыту каждого уровня оруженосца. Нерфит низкоуровневых существ и усиливает высокие. По умолчанию = TRUE
      "campaignTransfer":           "TRUE",     //  Передача параметров оруженосца через разные сценарии одной кампании, включая тип существа и опыт отряда. Кроме того, оруженосец не получает опыта в бою, если герой достиг максимального уровня в кампании. По умолчанию = TRUE
      "moreSantaGuards":            "TRUE",     //  Гвардия Санты умножается на уровень оруженосца Санта-Гремлина. По умолчанию = TRUE
      "reviveAnywhere":             "FALSE",    //  Оруженосца можно оживить в любой момент игры на карте приключений. Щелкните правой кнопкой мыши цветной флаг на экране героя, чтобы активировать его. По умолчанию = FALSE
    },     
    
    "strings_1": {
                                                //  Это для локализации. Здесь ничего не меняйте.
      "rank":          "{~r}Ранг{~} : @lv@",
      "banner":        "  {~r}Знамя{~} : ",
      "banner_-1":     "Нет",
      "banner_0":      "+Здоровье",
      "banner_1":      "+Атака",
      "banner_2":      "+Защита",
      "banner_3":      "+Урон",
      "banner_4":      "+Скорость",
      "banner_5":      "+Опыт Отряда",
      "banner_6":      "-Вражеская Защита",
      "banner_7":      "+Шанс Блока",
      "banner_8":      "+Контрудар",
      "bannerTitle":   "З Н А М Я  О Р У Ж Е Н О С Ц А",
      "bannerToHench": "Вы хотите передать Знамя Полководца своему оруженосцу?",
      "bannerDead":    "Мертвый оруженосец никак не реагирует на Знамя.",
      "bannerNone":    "Несмотря на то, что вы хотите отдать Знамя Полководца своему оруженосцу, в вашем рюкзаке его нет.",
      "bannerToHero":  "Передать Знамя герою."
    }
  }
}