{
  "henchmen": {
    "settings_0": {
                                                //  Change only values within quotation marks. Any change will only takes effect after restarting a scenario
                                                //  Total experience = battle Expericne + exp gained when hero level up + daily exp

                                                //  Battle experience is only given when your hero win a fight with henchman alive.
                                                //  Battle experience = Static + Random + Hero Exp Gained^0.5 * battleHeroExpCoef/100 + Hero Level * battleExpPerHeroLv
      "battleExpStatic":            "6",        //  Static exp for each battle. Default = 6
      "battleExpRandom":            "4",        //  Max random exp for each battle. Default = 4
      "battleHeroExpCoef":          "5",        //  Percentage of square root of battle exp gained of the hero. Default = 5
      "battleExpPerHeroLv":         "0",        //  Exp gained per hero level. Default = 0
      "battleExpMin":               "0",        //  Minimun exp for each battle. Default = 0
      "battleExpMax":               "1000",     //  Maximun exp for each battle. Default = 1000

                                                //  Leveling up your hero or passing a day grants your henchman an amount of exp.
      "bonusHeroLvUp":              "10",       //  Exp gained when hero level up. Default = 10
      "bonusDaily":                 "1",        //  Daily Experience. Default = 1

                                                //  Stack exp is completely different from battle exp. It only affects stack experience bonuses.
                                                //  Stack experience = hero battle exp
      "stackExpEnabled":            "TRUE",     //  Enable/disable henchman stack experience. Default = TRUE
      "stackExpTroopMode":          "TRUE",     //  Henchman stack exp works identically with troops. This means when you select a new henchman, the henchman gains stack exp from the creature selected. Apart from that, henchman now lose all stack exp and banner if killed on the battlefield. Default = TRUE
      "bannerEnabled":              "TRUE",     //  Enable/disable Warlord's Banner. Right-click on the coloured flag in the hero screen to activate. Default = TRUE
      "bannerFree":                 "FALSE",    //  Henchmen starts with banner equipped. Default = FALSE

                                                //  Spell Enhancement (0 - disabled)
      "bonusSpellDmgPerPwr":        "10",       //  Extra spell damage of each power. Default = 10
      "moreSpellEveryXKnl":         "30",       //  Knowledge requirement for one extra spell. Default = 30

                                                //  Tweaks
      "battleExpLossPct":           "0",        //  Percentage of battle exp loss when choosing a new henchman. Default = 0
      "battleExpAIPct":             "100",      //  Percentage of battle exp gaining for AI henchmen. Default 100
      "returnToArmy":               "TRUE",     //  Return henchman to the army when choosing a new one. Default = TRUE
      "altExpPerLv":                "TRUE",     //  Alternative exp requirement of each henchman level. Nerfs low-level creatures and buffs the high. Default = TRUE
      "campaignTransfer":           "TRUE",     //  Transfer henchman stats over campaign zones, including creature type and battle exp. Apart from that, henchmen gain no battle exp if the hero reached level cap in the campaign. Default = TRUE
      "moreSantaGuards":            "TRUE",     //  Santa Guards are multiplied by Santa Gremlin's henchman level. Default = TRUE
      "reviveAnywhere":             "FALSE",    //  Henchman can be revived anywhere on the map. Right-click on the coloured flag in the hero screen to activate. Default = TRUE
    },     
    
    "strings_0": {
                                                //  These are for localisation. Do not change anything here.
      "rank":          "{~r}Rank{~} : @lv@",
      "banner":        "  {~r}Banner{~} : ",
      "banner_-1":     "None",
      "banner_0":      "+Health",
      "banner_1":      "+Attack",
      "banner_2":      "+Defense",
      "banner_3":      "+Damage",
      "banner_4":      "+Speed",
      "banner_5":      "+Stack Experience",
      "banner_6":      "-Enemy Defense",
      "banner_7":      "+Block Chance",
      "banner_8":      "+Retaliation",
      "bannerTitle":   "H E N C H M A N ' S  B A N N E R",
      "bannerToHench": "Do you wish to pass the Warlord's Banner to your henchman?",
      "bannerDead":    "The dead henchman does not respond to any offer about Warlord's Banner.",
      "bannerNone":    "Despite how much you wish to give your henchman a Warlord's Banner, you don't have any in your backpack.",
      "bannerToHero":  "Pass this banner to the hero."
    }
  }
}