{
    "era": {
        "artifacts": {
            "0": {
                "name": "Spell Book",
                "description": "{Spell Book}\n\nLeft-click on the spell book to view your spells.",
                "event": "You trip over the Spell Book, dust it off, and stick it in your pack."
            },
            "1": {
                "name": "Spell Scroll",
                "description": "{Spell Scroll}\n\nThis scroll contains the [spell name] spell which is added into your spell book for as long as you carry the scroll.",
                "event": "You find an elaborate container which houses an old vellum scroll. The runes on the container are very old, and the artistry with which it was put together is stunning. As you pull the scroll out, you feel imbued with magical power."
            },
            "2": {
                "name": "The Grail",
                "description": "{The Grail}\n\nCarry the Grail to the city of your choice and the populace there will build a fantastic structure which will provide a tremendous advantage to the city's owner.",
                "event": "You trip over the Grail, dust it off, and stick it in your pack."
            },
            "3": {
                "name": "Catapult",
                "description": "{Catapult}\n\nUse this war machine to target your enemy's fortifications in combat.",
                "event": "You trip over the Catapult, dust it off, and stick it in your pack."
            },
            "4": {
                "name": "Ballista",
                "description": "{Ballista}\n\nUse this war machine to target your enemy's troops in combat.",
                "event": "You trip over the Ballista, dust it off, and stick it in your pack."
            },
            "5": {
                "name": "Ammo Cart",
                "description": "{Ammo Cart}\n\nThe Ammo Cart ensures that your missile troops will never run out of ammunition in combat.",
                "event": "You trip over the Ammo Cart, dust it off, and stick it in your pack."
            },
            "6": {
                "name": "First Aid Tent",
                "description": "{First Aid Tent}\n\nThe First Aid Tent provides healing to your troops during each round of combat.",
                "event": "You trip over the First Aid Tent, dust it off, and stick it in your pack."
            },
            "7": {
                "name": "Centaurs Axe",
                "description": "{Centaur's Axe}\n\nThis right handed weapon increases your Attack skill by +2.",
                "event": "You see a heavy axe embedded deeply in the ground.  After several unsuccessful attempts by your army to remove it, you tightly grip the handle of the axe and effortlessly pull it free."
            },
            "8": {
                "name": "Blackshard of the Dead Knight",
                "description": "{Blackshard of the Dead Knight}\n\nThis right handed weapon increases your Attack skill by +3.",
                "event": "The widow of a former Captain of the Guard admires your quest and gives you the enchanted Sword that her husband relied on during his tour of duty."
            },
            "9": {
                "name": "Greater Gnoll's Flail",
                "description": "{Greater Gnoll's Flail}\n\nThis right handed weapon increases your Attack skill by +4.",
                "event": "A clumsy Gnoll has killed himself with his own flail.  Knowing your superior skill with this weapon, you confidently remove the spectacular flail from the fallen creature."
            },
            "10": {
                "name": "Ogre's Club of Havoc",
                "description": "{Ogre's Club of Havoc}\n\nThis right handed weapon increases your Attack skill by +5.",
                "event": "At a roadside tavern, a drunken Ogre challenges you to a fight.  Not wanting to hurt the creature, you subdue him instead, and take his massive club from him to prevent him from getting into any more trouble."
            },
            "11": {
                "name": "Sword of Hellfire",
                "description": "{Sword of Hellfire}\n\nThis right handed weapon increases your Attack skill by +6.",
                "event": "During a sudden storm, a bolt of lightning strikes a tree, splitting it.  Inside the tree you find a mysterious sword."
            },
            "12": {
                "name": "Titan's Gladius",
                "description": "{Titan's Gladius}\n\nHeld with the right hand, this massive relic increases your Attack skill by +12, but reduces your Defense skill by -3.",
                "event": "A Titan stops you and says, \"Pay me 5,000 gold, or I shall slay you where you stand.\"  You refuse.  The Titan grabs the sword hanging from its belt, but you duck between its legs.  He is so surprised by this maneuver that he trips... falling on his sword and killing himself instantly."
            },
            "13": {
                "name": "Shield of the Dwarven Lords",
                "description": "{Shield of the Dwarven Lords}\n\nThis left handed item increases your Defense skill by +2.",
                "event": "While searching through the rubble of a caved-in mine, you free a group of trapped Dwarves.  Grateful, the leader gives you a finely crafted shield."
            },
            "14": {
                "name": "Shield of the Yawning Dead",
                "description": "{Shield of the Yawning Dead}\n\nThis left handed item increases your Defense skill by +3.",
                "event": "Your troops discover an eerie shrine dedicated to the Undead.  You bless the shrine, causing the stone shield emblem above the altar to crack.  Underneath it is a real shield, which you decide to separate from this unholy place."
            },
            "15": {
                "name": "Buckler of the Gnoll King",
                "description": "{Buckler of the Gnoll King}\n\nThis left handed item increases your Defense skill by +4.",
                "event": "A stone statue of a warrior holds a silver shield.  As you remove the shield, the statue crumbles into dust."
            },
            "16": {
                "name": "Targ of the Rampaging Ogre",
                "description": "{Targ of the Rampaging Ogre}\n\nThis left handed item increases your Defense skill by +5.",
                "event": "You come upon a bridge spanning a dry gully.  As you begin to cross, a gigantic, maddened Ogre appears from the other side and charges, forcing you to slay it.  You decide to take its shield as a trophy."
            },
            "17": {
                "name": "Shield of the Damned",
                "description": "{Shield of the Damned}\n\nThis left handed item increases your Defense skill by +6.",
                "event": "Upon cresting a small hill, you come upon a ridiculous looking sight.  A Sprite is attempting to carry a Shield that is almost as big as it is.  Trying not to laugh, you ask, \"Need help?\"  The Sprite glares at you and answers, \"You think this is funny?  Fine.  You can carry it.  I much prefer flying anyway.\""
            },
            "18": {
                "name": "Sentinel's Shield",
                "description": "{Sentinel's Shield}\n\nHeld with the left hand, this relic increases your Defense skill by +12, but reduces your Attack skill by -3.",
                "event": "You find a large box that seems to be made from some unknown metal.  When you touch it, the box opens with a loud hiss, revealing a gleaming shield within."
            },
            "19": {
                "name": "Helm of the Alabaster Unicorn",
                "description": "{Helm of the Alabaster Unicorn}\n\nWorn on the head, this item increases your Knowledge skill by +1.",
                "event": "A traveling tinker in need of supplies offers you a helm with a unicorn's horn on its top in exchange for food and water.  Curious, you accept, and later find out that the helm is magical."
            },
            "20": {
                "name": "Skull Helmet",
                "description": "{Skull Helmet}\n\nWorn on the head, this item increases your Knowledge skill by +2.",
                "event": "A brief stop at an improbable rural inn yields an exchange of money, tales, and accidentally, luggage.  You find a magical helm in your new backpack."
            },
            "21": {
                "name": "Helm of Chaos",
                "description": "{Helm of Chaos}\n\nWorn on the head, this item increases your Knowledge skill by +3.",
                "event": "Your army is ambushed by a small tribe of wild (and none too bright) Orcs.  You fend them off easily and the survivors flee in all directions.  One of the Orcs was wearing a polished horned helm.  Figuring it will make a good souvenir, you take it."
            },
            "22": {
                "name": "Crown of the Supreme Magi",
                "description": "{Crown of the Supreme Magi}\n\nWorn on the head, this item increases your Knowledge skill by +4.",
                "event": "A mad wizard who has been terrorizing the region has foolishly chosen you as his target today.  Realizing that his power comes from his crown, you take aim with your bow, knocking the crown from his head and releasing him from his crazed madness.  Grateful to be free, he lets you keep the crown."
            },
            "23": {
                "name": "Hellstorm Helmet",
                "description": "{Hellstorm Helmet}\n\nWorn on the head, this item increases your Knowledge skill by +5.",
                "event": "Your army is ambushed by a small tribe of wild (and none too bright) Orcs.  You fend them off easily and the survivors flee in all directions.  One of the Orcs was wearing a polished horned helm.  Figuring it will make a good souvenir, you take it."
            },
            "24": {
                "name": "Thunder Helmet",
                "description": "{Thunder Helmet}\n\nWhen worn, this relic increases your Knowledge skill by +10, but reduces your Power skill by -2.",
                "event": "A glint of golden light catches your eye.  Upon further investigation, you find a golden helm hidden under a bush."
            },
            "25": {
                "name": "Breastplate of Petrified Wood",
                "description": "{Breastplate of Petrified Wood}\n\nWorn on the torso, this item increases your Power skill by +1.",
                "event": "A gang of Rogues is sifting through the possessions of dead warriors.  Scaring off the scavengers, you note the Rogues had overlooked a strange breastplate."
            },
            "26": {
                "name": "Rib Cage",
                "description": "{Rib Cage}\n\nWorn on the torso, this item increases your Power skill by +2.",
                "event": "You trip over what was the rib cage of a large creature.  Upon further examination, you discover the rib cage to be a piece of armor."
            },
            "27": {
                "name": "Scales of the Greater Basilisk",
                "description": "{Scales of the Greater Basilisk}\n\nWorn on the torso, this item increases your Power skill by +3.",
                "event": "You meet an old Armorer who claims he owes you a favor.  Taking him up on it, he pieces together some Basilisk scales, forming a well-fashioned breastplate."
            },
            "28": {
                "name": "Tunic of the Cyclops King",
                "description": "{Tunic of the Cyclops King}\n\nWorn on the torso, this item increases your Power skill by +4.",
                "event": "You catch a Cyclops skinny dipping, and as a prank you make off with his clothes.  Later, you realize the tunic is magical."
            },
            "29": {
                "name": "Breastplate of Brimstone",
                "description": "{Breastplate of Brimstone}\n\nWorn on the torso, this item increases your Power skill by +5.",
                "event": "You meet a blacksmith who is in the process of melting down old pieces of armor and weapons to reclaim the metal.  When he learns of your quest, he gives you a breastplate that he claims refused to melt, and is therefore of no value to him."
            },
            "30": {
                "name": "Titan's Cuirass",
                "description": "{Titan's Cuirass}\n\nWhen worn, this massive relic increases your Power skill by +10, but reduces your Knowledge skill by -2.",
                "event": "A Titan stops you and says, \"Pay me 5,000 gold, or I shall slay you where you stand.\"  You refuse.  The Titan grabs the sword hanging from its belt, but you duck between its legs.  He is so surprised by this maneuver that he trips... falling on his sword and killing himself instantly.  You relieve him of his belongings."
            },
            "31": {
                "name": "Armor of Wonder",
                "description": "{Armor of Wonder}\n\nWorn on the torso, the Armor of Wonder increases all four primary skills by +1.",
                "event": "A gang of Rogues is sifting through the possessions of dead warriors.  Scaring off the scavengers, you note the Rogues had overlooked a dirty, but serviceable, breastplate."
            },
            "32": {
                "name": "Sandals of the Saint",
                "description": "{Sandals of the Saint}\n\nWorn on the feet, the Sandals of the Saint increase all four primary skills by +2.",
                "event": "A Nomad trader seeks protection from a tribe of Goblins.  For your assistance, he gives you a finely crafted pair of sandals made from the softest leather.  Looking closely, you see fascinating ancient carvings engraved on the leather."
            },
            "33": {
                "name": "Celestial Necklace of Bliss",
                "description": "{Celestial Necklace of Bliss}\n\nWorn about the neck, the Celestial Necklace of Bliss increases all four primary skills by +3.",
                "event": "After rescuing a Sorceress from a cursed tomb, she rewards your heroism with an exquisite jeweled necklace."
            },
            "34": {
                "name": "Lion's Shield of Courage",
                "description": "{Lion's Shield of Courage}\n\nHeld with the left hand, the Lion's Shield of Courage increases all four primary skills by +4.",
                "event": "You've come upon a fight between a Necromancer and a Paladin.  The Necromancer blasts the Paladin with a fire bolt, bringing him to his knees.  Acting quickly, you slay the evil one before the final blow.  The grateful Paladin gives you the shield that saved him."
            },
            "35": {
                "name": "Sword of Judgement",
                "description": "{Sword of Judgement}\n\nHeld with the right hand, the Sword of Judgement increases all four primary skills by +5.",
                "event": "You come upon a battle where a Paladin has been mortally wounded by a group of Zombies.  He asks you to take his sword and finish what he started.  As you pick it up, it begins to hum, and then everything becomes a blur.  The Zombies lie dead, the sword dripping with blood.  You strap it to your belt."
            },
            "36": {
                "name": "Helm of Heavenly Enlightenment",
                "description": "{Helm of Heavenly Enlightenment}\n\nWorn on the head, the Helm of Heavenly Enlightenment increases all four primary skills by +6.",
                "event": "You spy a gleaming object poking up out of the ground.   You send a member of your party over to investigate.  He comes back with a golden helmet in his hands.  You realize that it must be the Helm of Heavenly Enlightenment, the only helm ever rumored to be made from solid gold."
            },
            "37": {
                "name": "Quiet Eye of the Dragon",
                "description": "{Quiet Eye of the Dragon}\n\nWorn on a finger, this item increases your Attack and Defense skills by +1.",
                "event": "While venturing into a decrepit hut you find the skeleton of a long dead witch.  Investigation of the remains reveals a ring with a Dragon's eye set into it."
            },
            "38": {
                "name": "Red Dragon Flame Tongue",
                "description": "{Red Dragon Flame Tongue}\n\nHeld with the right hand, this item increases your Attack and Defense skills by +2.",
                "event": "As you are walking along a narrow path, a nearby bush suddenly bursts into flames.  Before your eyes the flames become the image of a beautiful woman.  She holds out a magnificent sword to you."
            },
            "39": {
                "name": "Dragon Scale Shield",
                "description": "{Dragon Scale Shield}\n\nHeld with the left hand, this item increases your Attack and Defense skills by +3.",
                "event": "You meet an old Armorer who claims he owes you a favor.  Taking him up on it, he pieces together some Dragon scales, forming a well-fashioned shield."
            },
            "40": {
                "name": "Dragon Scale Armor",
                "description": "{Dragon Scale Armor}\n\nWorn on a torso, this item increases your Attack and Defense skills by +4.",
                "event": "You meet an old Armorer who claims he owes you a favor.  Taking him up on it, he pieces together some Dragon scales, forming a well-fashioned breastplate."
            },
            "41": {
                "name": "Dragonbone Greaves",
                "description": "{Dragonbone Greaves}\n\nWorn on the feet, this item increases your Knowledge and Power skills by +1.",
                "event": "You trip over what seem to be the bones of a large Dragon.  Upon further examination, you discover the bones to be a pair of greaves."
            },
            "42": {
                "name": "Dragon Wing Tabard",
                "description": "{Dragon Wing Tabard}\n\nWorn on the shoulders, this item increases your Knowledge and Power skills by +2.",
                "event": "Ridding the countryside of the hideous Dragon who made a sport of eating noblemen's Knights, you are honored with a Dragon Wing Tabard."
            },
            "43": {
                "name": "Necklace of Dragonteeth",
                "description": "{Necklace of Dragonteeth}\n\nWorn about the neck, this item increases your Knowledge and Power skills by +3.",
                "event": "An old shaman stands in the road before you, screaming something in a language you can't understand.  He suddenly vanishes in a cloud of smoke.  When the smoke clears, there is a long string of Dragon teeth in the spot where he was standing."
            },
            "44": {
                "name": "Crown of Dragontooth",
                "description": "{Crown of Dragontooth}\n\nWorn on the head, this item increases your Knowledge and Power skills by +4.",
                "event": "While out scaring up game, your troops find a mysterious crown levitating about three feet off of the ground.  They hand it to you, and you notice an inscription.  It reads: \"Brains best brawn and magic beats might.  Heed my words, and you'll win every fight.\""
            },
            "45": {
                "name": "Still Eye of the Dragon",
                "description": "{Still Eye of the Dragon}\n\nWorn on the finger, this item increases your Luck and Morale by +1.",
                "event": "While venturing into a decrepit hut you find the skeleton of a long dead witch.  Investigation of the remains reveals a ring with a Dragon's eye set into it."
            },
            "46": {
                "name": "Clover of Fortune",
                "description": "{Clover of Fortune}\n\nThe Clover of Fortune increases your Luck by +1.",
                "event": "While walking across a patch of dried vegetation, you are surprised to find a healthy, green four-leaf clover."
            },
            "47": {
                "name": "Cards of Prophecy",
                "description": "{Cards of Prophecy}\n\nThe Cards of Prophecy increase your Luck by +1.",
                "event": "You meet a traveler who offers to let you draw a card from the strange deck that he carries.  When you refuse, he draws one himself.  He has a momentary look of surprise on his face, then vanishes with a pop, dropping the cards to the floor.  You gather them, and leave."
            },
            "48": {
                "name": "Ladybird of Luck",
                "description": "{Ladybird of Luck}\n\nThe Ladybird of Luck increases your Luck by +1.",
                "event": "An old witch who seems to have been expecting you, hands you a small statue and departs, never having said a word."
            },
            "49": {
                "name": "Badge of Courage",
                "description": "{Badge of Courage}\n\nThe Badge of Courage increases your Morale by +1 and grants immunity to all hostile mind spells.",
                "event": "After saving a young boy from a vicious pack of Wolves, you return him to his father's manor.  The grateful nobleman awards you with a Badge of Courage."
            },
            "50": {
                "name": "Crest of Valor",
                "description": "{Crest of Valor}\n\nThe Crest of Valor increases your Morale by +1.",
                "event": "After freeing a princess of a neighboring kingdom from the evil clutches of despicable slavers, she awards you with a Crest of Valor."
            },
            "51": {
                "name": "Glyph of Gallantry",
                "description": "{Glyph of Gallantry}\n\nThe Glyph of Gallantry increases your Morale by +1.",
                "event": "Ridding the countryside of the hideous Minotaur who made a sport of eating noblemen's Knights, you are honored with the Glyph of Gallantry."
            },
            "52": {
                "name": "Speculum",
                "description": "{Speculum}\n\nThe Speculum increases your Scouting radius by +1.",
                "event": "A merchant from far away lands trades you a new invention of his people for traveling supplies.  It makes distant objects appear closer, and he calls it... a Speculum."
            },
            "53": {
                "name": "Spyglass",
                "description": "{Spyglass}\n\nThe Spyglass increases your Scouting radius by +1.",
                "event": "An old man claiming to be an inventor asks you to try his latest invention.  He calls it... a Spyglass."
            },
            "54": {
                "name": "Amulet of the Undertaker",
                "description": "{Amulet of the Undertaker}\n\nWorn about the neck, this amulet increases your Necromancy skill by 5%.",
                "event": "A dirty amulet lies next to a freshly dug grave. Upon investigation, you discover it to be the enchanted Amulet of the Undertaker, long thought lost by mortals."
            },
            "55": {
                "name": "Vampire's Cowl",
                "description": "{Vampire's Cowl}\n\nWorn about the shoulders, this cowl increases your Necromancy skill by 10%.",
                "event": "You manage to find a Vampire's resting place during the day, and are able to slay him easily.  Just for good measure, you take his cowl."
            },
            "56": {
                "name": "Dead Man's Boots",
                "description": "{Dead Man's Boots}\n\nWorn on the feet, these boots increase your Necromancy skill by 15%.",
                "event": "Discovering a pair of beautifully beaded boots made from the finest and softest leather, you thank the anonymous donor and add the boots to your inventory."
            },
            "57": {
                "name": "Garniture of Interference",
                "description": "{Garniture of Interference}\n\nWorn about the neck, this item increases your Magic Resistance by 5%.",
                "event": "You've come upon a fight between a Necromancer and a Paladin.  The Necromancer blasts the Paladin with a fire bolt, bringing him to his knees.  Acting quickly, you slay the evil one before the final blow.  The grateful Paladin gives you the armor that saved him."
            },
            "58": {
                "name": "Surcoat of Counterpoise",
                "description": "{Surcoat of Counterpoise}\n\nWorn about the shoulders, this item increases your Magic Resistance by 10%.",
                "event": "You've come upon a fight between a Necromancer and a Paladin.  The Necromancer blasts the Paladin with a fire bolt, bringing him to his knees.  Acting quickly, you slay the evil one before the final blow.  The grateful Paladin gives you the cloak that saved him."
            },
            "59": {
                "name": "Boots of Polarity",
                "description": "{Boots of Polarity}\n\nWorn on the feet, these boots increase your Magic Resistance by 15%.",
                "event": "A Nomad trader seeks protection from a tribe of Goblins.  For your assistance, he gives you a finely crafted pair of boots made from the softest leather.  Looking closely, you see fascinating ancient carvings engraved on the leather."
            },
            "60": {
                "name": "Bow of Elven Cherrywood",
                "description": "{Bow of Elven Cherrywood}\n\nThis bow increases your Archery skill by 5%.",
                "event": "A chance meeting with a famous Archer finds you in a game of knucklebones pitting his bow against your horse.  You win."
            },
            "61": {
                "name": "Bowstring of the Unicorn's Mane",
                "description": "{Bowstring of the Unicorn's Mane}\n\nThis bowstring increases your Archery skill by 10%.",
                "event": "An ensnared Unicorn whinnies in fright.  Murmuring soothing words, you set her free.  Snorting and stamping her front hoof once, she gallops off.  Looking down you see that she dropped what appears to be a finely crafted bowstring."
            },
            "62": {
                "name": "Angel Feather Arrows",
                "description": "{Angel Feather Arrows}\n\nThese arrows increase your Archery skill by 15%.",
                "event": "Not really wanting to know where the Angel is whose feathers were used for these arrows, you take them and quickly depart."
            },
            "63": {
                "name": "Bird of Perception",
                "description": "{Bird of Perception}\n\nThis figurine increases your Eagle Eye skill by 5%.",
                "event": "An old witch who seems to have been expecting you, hands you a small statue and departs, never having said a word."
            },
            "64": {
                "name": "Stoic Watchman",
                "description": "{Stoic Watchman}\n\nThis figurine increases your Eagle Eye skill by 10%.",
                "event": "An old witch who seems to have been expecting you, hands you a small statue and departs, never having said a word."
            },
            "65": {
                "name": "Emblem of Cognizance",
                "description": "{Emblem of Cognizance}\n\nThis item increases your Eagle Eye skill by 15%.",
                "event": "An old witch who seems to have been expecting you, hands you a small talisman and departs, never having said a word."
            },
            "66": {
                "name": "Statesman's Medal",
                "description": "{Statesman's Medal}\n\nWorn about the neck, the Statesman's Medal reduces the cost of surrendering.",
                "event": "You pause to help a diplomat with a broken axle fix his problem.  In gratitude, he gives you a medal with magical properties which he says will, \"help people see things your way.\""
            },
            "67": {
                "name": "Diplomat's Ring",
                "description": "{Diplomat's Ring}\n\nWorn on the finger, the Diplomat's Ring reduces the cost of surrendering.",
                "event": "You pause to help a diplomat with a broken axle fix his problem.  In gratitude, he gives you a ring with magical properties which he says will, \"help people see things your way.\""
            },
            "68": {
                "name": "Ambassador's Sash",
                "description": "{Ambassador's Sash}\n\nWorn about the shoulders, the Ambassador's Sash reduces the cost of surrendering.",
                "event": "You pause to help a diplomat with a broken axle fix his problem.  In gratitude, he gives you a sash with magical properties which he says will, \"help people see things your way.\""
            },
            "69": {
                "name": "Ring of the Wayfarer",
                "description": "{Ring of the Wayfarer}\n\nWhen placed on the finger, this ring increases the combat speed of all your units by +1.",
                "event": "Visiting a local wise man, you explain the intent of your journey.  He reaches into a sack and withdraws a strange ring which he hands to you."
            },
            "70": {
                "name": "Equestrian's Gloves",
                "description": "{Equestrian's Gloves}\n\nWorn on the hands, these gloves increase your hero's movement rate over land.",
                "event": "A brief stop at an improbable rural inn yields an exchange of money, tales, and accidentally, luggage.  You find a magical pair of gloves in your new backpack."
            },
            "71": {
                "name": "Necklace of Ocean Guidance",
                "description": "{Necklace of Ocean Guidance}\n\nWorn about the neck, this necklace increases your hero's movement rate at sea.",
                "event": "An old sea captain is being tortured by Ogres.  You save him, and in return he rewards you with a wondrous necklace that will guide you at sea."
            },
            "72": {
                "name": "Angel Wings",
                "description": "{Angel Wings}\n\nWorn about the shoulders, these wings allow you to fly.",
                "event": "Not really wanting to know where the Angel is who belongs to these wings, you take them and quickly depart."
            },
            "73": {
                "name": "Charm of Mana",
                "description": "{Charm of Mana}\n\nThis charm helps you recover 1 extra spell point per day.",
                "event": "You come upon a caravan of gypsies who are feasting and fortifying their bodies with mead.  They call you forward and say, \"If you prove that you can dance the Rama-Buta, we will reward you.\"  You don't know it, but try anyway.  They laugh hysterically, but admire your bravery, giving you a strange charm."
            },
            "74": {
                "name": "Talisman of Mana",
                "description": "{Talisman of Mana}\n\nThis talisman helps you recover 2 extra spell points per day.",
                "event": "You come upon a caravan of gypsies who are feasting and fortifying their bodies with mead.  They call you forward and say, \"If you prove that you can dance the Rama-Buta, we will reward you.\"  You don't know it, but try anyway.  They laugh hysterically, but admire your bravery, giving you a strange talisman."
            },
            "75": {
                "name": "Mystic Orb of Mana",
                "description": "{Mystic Orb of Mana}\n\nThis orb helps you recover 3 extra spell points per day.",
                "event": "You come upon a caravan of gypsies who are feasting and fortifying their bodies with mead.  They call you forward and say, \"If you prove that you can dance the Rama-Buta, we will reward you.\"  You don't know it, but try anyway.  They laugh hysterically, but admire your bravery, giving you a strange orb."
            },
            "76": {
                "name": "Collar of Conjuring",
                "description": "{Collar of Conjuring}\n\nWorn about the neck, this item increases the duration of all your spells by 1.",
                "event": "Before you appears a levitating glass case with a golden choker perched upon a bed of crimson velvet.  At your touch, the lid opens and the choker floats into your awaiting hands."
            },
            "77": {
                "name": "Ring of Conjuring",
                "description": "{Ring of Conjuring}\n\nWorn on a finger, this item increases the duration of all your spells by 2.",
                "event": "You find a small tree that closely resembles the great Warlock, Brimstone, with a ring around one of its twigs.  Scraps of clothing and rotting leather lead you to suspect that it IS Brimstone, transformed.  Since you can't help him, you take the magic ring."
            },
            "78": {
                "name": "Cape of Conjuring",
                "description": "{Cape of Conjuring}\n\nWorn about the shoulders, this item increases the duration of all your spells by 3.",
                "event": "Before you appears a levitating glass case with a folded cloak perched upon a bed of crimson velvet.  At your touch, the lid opens and the cloak floats into your awaiting hands."
            },
            "79": {
                "name": "Orb of the Firmament",
                "description": "{Orb of the Firmament}\n\nThis powerful orb causes your Air spells to inflict an additional 50% damage.",
                "event": "You come across a conjurer who begs to accompany you and your army awhile for safety.  You agree, and he offers as payment a strange orb of the elements."
            },
            "80": {
                "name": "Orb of Silt",
                "description": "{Orb of Silt}\n\nThis powerful orb causes your Earth spells to inflict an additional 50% damage.",
                "event": "You come across a conjurer who begs to accompany you and your army awhile for safety.  You agree, and he offers as payment a strange orb of the elements."
            },
            "81": {
                "name": "Orb of Tempestuous Fire",
                "description": "{Orb of Tempestuous Fire}\n\nThis powerful orb causes your Fire spells to inflict an additional 50% damage.",
                "event": "You come across a conjurer who begs to accompany you and your army awhile for safety.  You agree, and he offers as payment a strange orb of the elements."
            },
            "82": {
                "name": "Orb of Driving Rain",
                "description": "{Orb of Driving Rain}\n\nThis powerful orb causes your Water spells to inflict an additional 50% damage.",
                "event": "You come across a conjurer who begs to accompany you and your army awhile for safety.  You agree, and he offers as payment a strange orb of the elements."
            },
            "83": {
                "name": "Recanter's Cloak",
                "description": "{Recanter's Cloak}\n\nWhile wearing this cloak, neither you nor your opponent will be able to cast level 3 or higher spells during combat.",
                "event": "Responding to the panicked cries of a damsel in distress, you discover a young woman fleeing from a hungry bear.  You slay the beast in the nick of time, and the grateful Sorceress weaves a magic cloak from the bear's hide."
            },
            "84": {
                "name": "Spirit of Oppression",
                "description": "{Spirit of Oppression}\n\nThis item negates all Morale bonuses during combat for both you and your opponent.",
                "event": "Walking through the ruins of an ancient walled city, you find the instrument of the city's destruction, the Spirit of Oppression."
            },
            "85": {
                "name": "Hourglass of the Evil Hour",
                "description": "{Hourglass of the Evil Hour}\n\nThis item negates all Luck bonuses during combat for both you and your opponent.",
                "event": "A surprise turn in the landscape finds you in the midst of a grisly scene - vultures picking at the aftermath of a terrible battle.  Your cursory search of the remains turns up an enchanted hourglass."
            },
            "86": {
                "name": "Tome of Fire Magic",
                "description": "{Tome of Fire Magic}\n\nThis heavy book contains all spells in the school of Fire Magic.  It must be equipped for the spells to be available.",
                "event": "You come across a conjurer who begs to accompany you and your army awhile for safety.  You agree, and he offers as payment a copy of a book of the elements."
            },
            "87": {
                "name": "Tome of Air Magic",
                "description": "{Tome of Air Magic}\n\nThis heavy book contains all spells in the school of Air Magic.  It must be equipped for the spells to be available.",
                "event": "You come across a conjurer who begs to accompany you and your army awhile for safety.  You agree, and he offers as payment a copy of a book of the elements."
            },
            "88": {
                "name": "Tome of Water Magic",
                "description": "{Tome of Water Magic}\n\nThis heavy book contains all spells in the school of Water Magic.  It must be equipped for the spells to be available.",
                "event": "You come across a conjurer who begs to accompany you and your army awhile for safety.  You agree, and he offers as payment a copy of a book of the elements."
            },
            "89": {
                "name": "Tome of Earth Magic",
                "description": "{Tome of Earth Magic}\n\nThis heavy book contains all spells in the school of Earth Magic.  It must be equipped for the spells to be available.",
                "event": "You come across a conjurer who begs to accompany you and your army awhile for safety.  You agree, and he offers as payment a copy of a book of the elements."
            },
            "90": {
                "name": "Boots of Levitation",
                "description": "{Boots of Levitation}\n\nWhen worn, these boots allow you to walk across water.",
                "event": "Visiting a local wise man, you explain the intent of your journey.  He reaches into a chest and withdraws a strange pair of boots which he hands to you."
            },
            "91": {
                "name": "Golden Bow",
                "description": "{Golden Bow}\n\nWhen wielded, the Golden Bow allows your troops to shoot through any obstacle or at any range without penalty.",
                "event": "A chance meeting with a famous Archer finds you in a game of knucklebones pitting his bow against your horse.  You win."
            },
            "92": {
                "name": "Sphere of Permanence",
                "description": "{Sphere of Permanence}\n\nWielding this sphere renders your units immune to the Dispel Magic spell.",
                "event": "You meet an old Wizard friend of yours traveling in the opposite direction.  He presents  you with a gift:  An orb that prevents the use of the dispel magic spell on your allies."
            },
            "93": {
                "name": "Orb of Vulnerability",
                "description": "{Orb of Vulnerability}\n\nDuring combat, this orb negates the natural magic resistance of all creatures on the battlefield.",
                "event": "You meet an old Wizard friend of yours traveling in the opposite direction.  He presents  you with a gift:  An orb that allows nearby magic resistant creatures to be harmed by magic."
            },
            "94": {
                "name": "Ring of Vitality",
                "description": "{Ring of Vitality}\n\nThis item increases the health of all your units by +1.",
                "event": "While pausing to rest, you notice a bobcat climbing a short tree to get at a crow's nest.  On impulse, you climb the tree yourself and scare off the cat.  When you look in the nest, you find a collection of shiny stones and a ring."
            },
            "95": {
                "name": "Ring of Life",
                "description": "{Ring of Life}\n\nThis item increases the health of all your units by +1.",
                "event": "While pausing to rest, you notice a bobcat climbing a short tree to get at a crow's nest.  On impulse, you climb the tree yourself and scare off the cat.  When you look in the nest, you find a collection of shiny stones and a ring."
            },
            "96": {
                "name": "Vial of Lifeblood",
                "description": "{Vial of Lifeblood}\n\nThis item increases the health of all your units by +2.",
                "event": "You find a mystical shrine hidden among the trees.  Floating above the altar is a Vial said to contain the blood of life.  You very carefully remove it, taking care not to disturb anything else."
            },
            "97": {
                "name": "Necklace of Swiftness",
                "description": "{Necklace of Swiftness}\n\nWorn about the neck, this necklace increases the combat speed of all your units by +1.",
                "event": "Visiting a local wise man, you explain the intent of your journey.  He reaches into a sack and withdraws a strange necklace which he hands to you."
            },
            "98": {
                "name": "Boots of Speed",
                "description": "{Boots of Speed}\n\nWorn on the feet, these boots increase your hero's movement rate over land.",
                "event": "Visiting a local wise man, you explain the intent of your journey.  He reaches into a chest and withdraws a strange pair of boots which he hands to you."
            },
            "99": {
                "name": "Cape of Velocity",
                "description": "{Cape of Velocity}\n\nWorn about the shoulders, this cape increases the combat speed of all your units by +2.",
                "event": "A brief stop at an improbable rural inn yields an exchange of money, tales, and accidentally, luggage.  You find a magical cloak in your new backpack."
            },
            "100": {
                "name": "Pendant of Dispassion",
                "description": "{Pendant of Dispassion}\n\nWearing this item renders your units immune to the Berserk spell.",
                "event": "The sound of combat draws you to the scene of a fight between an old Barbarian and an eight-headed Hydra.  Your timely intervention swings the battle in favor of the man, and he rewards you with a pendant he used to use to calm his mind for battle."
            },
            "101": {
                "name": "Pendant of Second Sight",
                "description": "{Pendant of Second Sight}\n\nWearing this item renders your units immune to the Blind spell.",
                "event": "You come upon a very old woman, long blind from cataracts and dying alone.  You tend to her final needs and promise a proper burial.  Grateful, she gives you a magic pendant emblazoned with a stylized eye.  It lets you see with your eyes closed."
            },
            "102": {
                "name": "Pendant of Holiness",
                "description": "{Pendant of Holiness}\n\nWearing this item renders your units immune to the Curse spell.",
                "event": "In your wanderings you come across a hermit living in a small, tidy hut.  Impressed with your mission, he takes time out from his meditations to bless and give you a charm against curses."
            },
            "103": {
                "name": "Pendant of Life",
                "description": "{Pendant of Life}\n\nWearing this item renders your units immune to the Death Ripple spell.",
                "event": "A fierce windstorm reveals the entrance to a buried tomb.  Your investigation reveals that the tomb has already been looted, but the thieves overlooked an ankh on a gold chain in the dark."
            },
            "104": {
                "name": "Pendant of Death",
                "description": "{Pendant of Death}\n\nWearing this item renders your units immune to the Destroy Undead spell.",
                "event": "A quick and deadly battle with a Necromancer wins you his magical pendant.  Later, a Wizard tells you that the pendant protects undead under your control from spells meant to destroy them."
            },
            "105": {
                "name": "Pendant of Free Will",
                "description": "{Pendant of Free Will}\n\nWearing this item renders your units immune to the Hypnotize spell.",
                "event": "A brief roadside encounter with a small caravan and a game of knucklebones wins a magic pendant.  Its former owner says that it protects against hypnosis."
            },
            "106": {
                "name": "Pendant of Negativity",
                "description": "{Pendant of Negativity}\n\nWearing this item renders your units immune to the Lightning Bolt and Chain Lightning spells.",
                "event": "You come upon the remains of a small hut which was clearly destroyed by a very large bolt of lightning.  Sifting through the debris, you find an undamaged pendant that seems to tingle in your hand."
            },
            "107": {
                "name": "Pendant of Total Recall",
                "description": "{Pendant of Total Recall}\n\nWearing this item renders your units immune to the Forgetfulness spell.",
                "event": "Alongside the remains of a burnt witch lies a beautiful pendant, intricately designed.  Approaching the corpse with caution, you add the item to your inventory."
            },
            "108": {
                "name": "Pendant of Courage",
                "description": "{Pendant of Courage}\n\nWhen worn, this item bestows +3 Luck and Morale to your hero's troops.",
                "event": "Responding to cries for help, you find river Sprites making a sport of dunking an old man.  Feeling vengeful, you rescue the man and drag a Sprite onto dry land for awhile.  The Sprite, uncomfortable in the air, gives you a magic pendant to let him go."
            },
            "109": {
                "name": "Everflowing Crystal Cloak",
                "description": "{Everflowing Crystal Cloak}\n\nWhen worn, this cloak increases your Crystal production by +1 per day.",
                "event": "Taking shelter from a storm in a small cave,  you notice a small patch of crystal in one corner.  Curious, you discover that the patch is really a cloak, and when you break a piece off it mysteriously grows back.  You decide to take the cloak with you."
            },
            "110": {
                "name": "Ring of Infinite Gems",
                "description": "{Ring of Infinite Gems}\n\nWhen worn, this ring increases your Gem production by +1 per day.",
                "event": "A cry of pain leads you to a Centaur, caught in a trap.  Upon setting the creature free, he hands you a small pouch.  Emptying the contents, you find a dazzling jeweled ring."
            },
            "111": {
                "name": "Everpouring Vial of Mercury",
                "description": "{Everpouring Vial of Mercury}\n\nWhen equipped, this vial increases your Mercury production by +1 per day.",
                "event": "A brief stop at a hastily abandoned Wizard's tower turns up a magical vial of mercury that always has a little left on the bottom.  Recognizing a treasure when you see one, you cap it and slip it in your pocket."
            },
            "112": {
                "name": "Inexhaustible Cart of Ore",
                "description": "{Inexhaustible Cart of Ore}\n\nWhen equipped, this cart provides you with an additional +1 Ore per day.",
                "event": "You've found a Goblin weapon smithy making weapons for use against humans.  With a tremendous yell you and your army descend upon their camp and drive them away.  A search finds a magic cart that never runs out of ore."
            },
            "113": {
                "name": "Eversmoking Ring of Sulfur",
                "description": "{Eversmoking Ring of Sulfur}\n\nWhen worn, this ring increases your Sulfur production by +1 per day.",
                "event": "You visit an alchemist who, upon seeing your army, is swayed by the righteousness of your cause.  The newly loyal subject gives you his eversmoking ring of sulfur to help with the war effort."
            },
            "114": {
                "name": "Inexhaustible Cart of Lumber",
                "description": "{Inexhaustible Cart of Lumber}\n\nWhen equipped, this cart provides you with an additional +1 Wood per day.",
                "event": "Pausing to rest and light a cook fire, you pull wood out of a nearby lumber cart.  As you keep pulling wood from the cart, you notice that its cargo doesn't shrink.  You realize to your delight that the cart is enchanted, so you take it along."
            },
            "115": {
                "name": "Endless Sack of Gold",
                "description": "{Endless Sack of Gold}\n\nWhen equipped, the Endless Sack of Gold increases your income by 1000 gold per day.",
                "event": "A little leprechaun dances gleefully around a magic sack.  Seeing you approach, he stops in mid-stride.  The little man screams and stamps his foot ferociously, vanishing into thin air.  Remembering the old leprechaun saying 'Finders Keepers', you grab the sack and leave."
            },
            "116": {
                "name": "Endless Bag of Gold",
                "description": "{Endless Bag of Gold}\n\nWhen equipped, the Endless Bag of Gold increases your income by 750 gold per day.",
                "event": "A noblewoman, separated from her traveling companions, asks for your help.  After escorting her home, she rewards you with a bag filled with gold."
            },
            "117": {
                "name": "Endless Purse of Gold",
                "description": "{Endless Purse of Gold}\n\nWhen equipped, the Endless Purse of Gold increases your income by 500 gold per day.",
                "event": "In your travels, you find a leather purse filled with gold that once belonged to a great warrior king who had the ability to transform any inanimate object into gold."
            },
            "118": {
                "name": "Legs of Legion",
                "description": "{Legs of Legion}\n\nThis item, when equipped by a hero in a town, increases the growth of your 2nd level units (in that town) by 5 per week.",
                "event": "Searching a ruin, you are amazed to find a piece of the Statue of Legion.  You carefully dust it off before placing it in your pack."
            },
            "119": {
                "name": "Loins of Legion",
                "description": "{Loins of Legion}\n\nThis item, when equipped by a hero in a town, increases the growth of your 3rd level units (in that town) by 4 per week.",
                "event": "Searching a ruin, you are amazed to find a piece of the Statue of Legion.  You carefully dust it off before placing it in your pack."
            },
            "120": {
                "name": "Torso of Legion",
                "description": "{Torso of Legion}\n\nThis item, when equipped by a hero in a town, increases the growth of your 4th level units (in that town) by 3 per week.",
                "event": "Searching a ruin, you are amazed to find a piece of the Statue of Legion.  You carefully dust it off before placing it in your pack."
            },
            "121": {
                "name": "Arms of Legion",
                "description": "{Arms of Legion}\n\nThis item, when equipped by a hero in a town, increases the growth of your 5th level units (in that town) by 2 per week.",
                "event": "Searching a ruin, you are amazed to find a piece of the Statue of Legion.  You carefully dust it off before placing it in your pack."
            },
            "122": {
                "name": "Head of Legion",
                "description": "{Head of Legion}\n\nThis item, when equipped by a hero in a town, increases the growth of your 6th level units (in that town) by 1 per week.",
                "event": "Searching a ruin, you are amazed to find a piece of the Statue of Legion.  You carefully dust it off before placing it in your pack."
            },
            "123": {
                "name": "Sea Captain's Hat",
                "description": "{Sea Captain's Hat}\n\nWhen worn, this hat increases your movement at sea, allows you to summon and destroy boats, and protects you from whirlpools.",
                "event": "An old seaman tells you a tale of an enchanted hat that he used in his youth to rally his crew into fits of efficiency.  He then hands you a faded map that shows where he hid it.  After much exploring, you find it stashed underneath a nearby rock."
            },
            "124": {
                "name": "Spellbinder's Hat",
                "description": "{Spellbinder's Hat}\n\nWhen worn, this hat allows you to cast all 5th level spells.",
                "event": "You see a Wizard fleeing from a Dragon and riding like the wind.  The Wizard opens a portal and rides through, getting his hat knocked off by the edge of the gate.  The Dragon follows, and the gate closes.  You pick the hat up, dust it off, and put it on."
            },
            "125": {
                "name": "Shackles of War",
                "description": "{Shackles of War}\n\nWhen these shackles are wielded in combat, neither you nor your opponent may retreat or surrender.",
                "event": "Walking through the ruins of an ancient walled city, you find the instrument of the city's destruction, the elaborately crafted Shackles of War."
            },
            "126": {
                "name": "Orb of Inhibition",
                "description": "{Orb of Inhibition}\n\nThis powerful orb prevents all spell casting in combat.",
                "event": "You stop to help a Peasant catch a runaway mare.  To show his gratitude, he hands you a tiny sphere.  As soon as you grasp it, you feel the magical energy drain from your limbs..."
            },
            "127": {
                "name": "Vial of Dragon Blood",
                "description": "{Vial of Dragon Blood}\n\nAll dragons under your command receive +5 to their attack and +5 to defense.",
                "event": "You find a cave guarded by an ancient dragon.  After a fierce battle, you slay him.  Dragon blood supposedly has magical properties, so you carefully gather some in a vial."
            },
            "128": {
                "name": "Armageddon's Blade",
                "description": "{Armageddon's Blade}\n\n+ 3 Attack. + 3 Defense. + 6 Knowledge. + 3 Power. Places Expert Armageddon Spell in your hero's spell book. All allied creatures become immune to Armageddon.",
                "event": "Deep beneath the earth, you find a vault of the Ancients from before the Silence.  Inside, you find a sealed casket, deeply etched with dire warnings.  Ignoring them, you break the seal.  Inside, you find Armageddon's Blade."
            },
            "129": {
                "name": "Angelic Alliance",
                "description": "{Angelic Alliance}\n\nAllows Rampart, Tower, Fortress, Stronghold and Castle creatures to be mixed without a morale penalty, for the player.  Casts Expert Prayer at the start of combat.",
                "event": "You trip over the Angelic Alliance, dust it off, and stick it in your pack."
            },
            "130": {
                "name": "Cloak of the Undead King",
                "description": "{Cloak of the Undead King}\n\n30% of battlefield dead are resurrected as Skeletons.  If hero already has the Necromancy skill then the percentages are added to the skill and the level of skill determines what type is resurrected.  Basic: Zombies\nAdvanced: Wights\nExpert:  Liches",
                "event": "You trip over the Cloak of the Undead King, dust it off, and stick it in your pack."
            },
            "131": {
                "name": "Elixir of Life",
                "description": "{Elixir of Life}\n\nAll creatures get a 25% health bonus and gain the regeneration ability.  Does not work on Undead or unliving creatures",
                "event": "You trip over the Elixir of Life, dust it off, and stick it in your pack."
            },
            "132": {
                "name": "Armor of the Damned",
                "description": "{Armor of the Damned}\n\nAll opponents have these spells effective on them for fifty turns: Slow, Curse, Weakness, and Misfortune.",
                "event": "You trip over the Armor of the Damned, dust it off, and stick it in your pack."
            },
            "133": {
                "name": "Statue of Legion",
                "description": "{Statue of Legion}\n\nAll creature production increases by 50%, in all towns based off of the castle creature generation level, does not include flagged structures or other like bonuses.",
                "event": "You trip over the Statue of Legion, dust it off, and stick it in your pack."
            },
            "134": {
                "name": "Power of the Dragon Father",
                "description": "{Power of the Dragon Father}\n\n+6 to all primary skills, all troops are immune to 1-4th level spells.",
                "event": "You trip over the Power of the Dragon Father, dust it off, and stick it in your pack."
            },
            "135": {
                "name": "Titan's Thunder",
                "description": "{Titan's Thunder}\n\nHero gains the ability to cast Lightning Bolt for 600 points of damage, does not cost any spell points, adds a spell book into their inventory (permanently).",
                "event": "You trip over the Titan's Thunder, dust it off, and stick it in your pack."
            },
            "136": {
                "name": "Admiral's Hat",
                "description": "{Admiral's Hat}\n\nNo boarding or unboarding ship penalty.  Converts movement points between the Hero's Land and Water movement.",
                "event": "You trip over the Admiral's Hat, dust it off, and stick it in your pack."
            },
            "137": {
                "name": "Bow of the Sharpshooter",
                "description": "{Bow of the Sharpshooter}\n\nRanged shooters may fire projectiles while adjacent to an enemy creature.  No archery penalty for range or obstacle",
                "event": "You trip over the Bow of the Sharpshooter, dust it off, and stick it in your pack."
            },
            "138": {
                "name": "Wizard's Well",
                "description": "{Wizard's Well}\n\nRegenerates all spell points each day",
                "event": "You trip over the Wizard's Well, dust it off, and stick it in your pack."
            },
            "139": {
                "name": "Ring of the Magi",
                "description": "{Ring of the Magi}\n\nAdd 50 rounds to spell duration.",
                "event": "You trip over the Ring of the Magi, dust it off, and stick it in your pack."
            },
            "140": {
                "name": "Cornucopia",
                "description": "{Cornucopia}\n\nGenerates 4 of each precious resource, each day.",
                "event": "You trip over the Cornucopia, dust it off, and stick it in your pack."
            },
            "141": {
                "name": "Magic Wand",
                "description": "{Magic Wand}\n\nTransforms equipped artifacts daily.\n{Slot1}=Head and Neck\n{Slot2}=Right and Left Hand\n{Slot3}=Right and Left Ring\n{Slot4}=Torso and Feet\n{Slot5}=Shoulders and Slot4",
                "event": "You find the Magic Wand, dust it off, and stick it in your pack."
            },
            "142": {
                "name": "Gold Tower Arrow",
                "description": "{Gold Tower Arrow}\n\nGives power over Arrow Towers. If equipped by attacking hero, towers will not shoot at all. If equipped by defending hero, depends on ballistics skill:\nNone: Towers shoot twice.\nBasic: Towers shoot 3 times.\nAdvanced: Towers shoot 4 times.\nExpert: Towers shoot 5 times.",
                "event": "You find the Gold Tower Arrow, dust it off, and stick it in your pack."
            },
            "143": {
                "name": "Monster's Power",
                "description": "{Monster's Power}\n\nCasts Prayer spell on all monsters of one type, randomly chosen from the hero's army at the beginning of each week. Affects all monsters of this type for the week, regardless of owner.",
                "event": "You find the Monster's Power, dust it off, and stick it in your pack."
            },
            "144": {
                "name": "-1",
                "description": "-1d"
            },
            "145": {
                "name": "-2",
                "description": "-2d"
            },
            "146": {
                "name": "Axe of Smashing",
                "description": "{Axe of Smashing}\n\nGives +5 Attack\nplus +1 Attack after 6 victorious battles.\n\nTo give this artifact to your Commander, drag it to the Commander icon.",
                "event": "You pick up the heavy Axe of Smashing. You're sure your Commander would love to smash a few heads with it!"
            },
            "147": {
                "name": "Mithril Mail",
                "description": "{Mithril Mail}\n\nGives +12% Health\nplus +1% Health after every victorious battle.\n\nTo give this artifact to your Commander, drag it to the Commander icon.",
                "event": "You pick up the gleaming suit of Mithril Mail. This armor will surely extend your Commander's life when worn in battle!"
            },
            "148": {
                "name": "Sword of Sharpness",
                "description": "{Sword of Sharpness}\n\nGives +12% Damage\nplus +1% Damage after every victorious battle.\n\nTo give this artifact to your Commander, drag it to the Commander icon.",
                "event": "You pick up the glowing Sword of Sharpness. You're sure your Commander will enjoy chopping the enemy to pieces with it!"
            },
            "149": {
                "name": "Helm of Immortality",
                "description": "{Helm of Immortality}\n\nRevives a slain Commander immediately after battle\n(artifact incremental bonuses are not lost).\n\nTo give this artifact to your Commander, drag it to the Commander icon.",
                "event": "You pick up the shining Helm of Immortality. If your Commander wears this, death will never last for long!"
            },
            "150": {
                "name": "Pendant of Sorcery",
                "description": "{Pendant of Sorcery}\n\nGives +1 Magic Power\nplus +1 Magic Power after 10 victorious battles.\n\nTo give this artifact to your Commander, drag it to the Commander icon.",
                "event": "You pick up the ancient Pendant of Sorcery. With this magical pendant, your Commander's Magic Power will grow stronger!"
            },
            "151": {
                "name": "Boots of Haste",
                "description": "{Boots of Haste}\n\nGives +1 Speed\nplus +1 Speed after 10 victorious battles.\n\nTo give this artifact to your Commander, drag it to the Commander icon.",
                "event": "You pick up the well-made Boots of Haste. These boots will surely lend wings to your Commander's feet on the battlefield!"
            },
            "152": {
                "name": "Bow of Seeking",
                "description": "{Bow of Seeking}\n\nGives \"No Obstacle Penalty\"\nplus \"No Long-Range Penalty\" after 25 victorious battles.\n\nTo give this artifact to your Commander, drag it to the Commander icon.",
                "event": "You pick up the finely-crafted Bow of Seeking. If used by a Commander skilled in archery, long distances and walls will never be a hindrance again!"
            },
            "153": {
                "name": "Dragon Eye Ring",
                "description": "{Dragon Eye Ring}\n\nGives Commander Breath Attack (two squares)\nand\nDragon nature (gets bonuses as Dragons).\n\nTo give this artifact to your Commander, drag it to the Commander icon.",
                "event": "You pick up the beautiful Dragon Eye Ring. On your Commander's finger, this ring will bestow the power of dragons!"
            },
            "154": {
                "name": "Hardened Shield",
                "description": "{Hardened Shield}\n\nGives +5 Defense\nplus +1 Defense after 6 victorious battles.\n\nTo give this artifact to your Commander, drag it to the Commander icon.",
                "event": "You pick up the Hardened Shield. With this excellent shield, your Commander's defenses will surely improve!"
            },
            "155": {
                "name": "Slava's Ring of Power",
                "description": "{Slava's Ring of Power}\n\nGives Commander all six Primary Skills at Advanced level.\n\nTo give this artifact to your Commander, drag it to the Commander icon.",
                "event": "You pick up Slava's Ring of Power and can feel its strong magic. On your Commander's finger, this ring will bestow great power!"
            },
            "156": {
                "name": "Warlord's Banner",
                "description": "{Warlord's Banner}\n\nWith stack experience enabled, the Warlord's Banner gives additional bonuses in combat. To equip it, drag it to the troop stack of your choice.\n\nChoose a bonus by right-clicking on the Banner in the stack's experience screen. You can change the bonus any time except in combat.",
                "event": "You pick up the Warlord's Banner. If you give this artifact to your troops, it could lead them to victory!"
            },
            "157": {
                "name": "Crimson Shield of Retribution",
                "description": "{Crimson Shield of Retribution}\n\nHeld in the left hand, this artifact increases Defense skill by +2 and gives all creatures in a hero's ranks the ability to retaliate against creatures that cannot normally be retaliated against.",
                "event": "Strapping on the Crimson Shield of Retribution, you notice the look of steely resolve upon the faces of your troops, and now know that they will always be able to answer blood with blood in the heat of battle."
            },
            "158": {
                "name": "Barbarian Lord's Axe of Ferocity",
                "description": "{Barbarian Lord's Axe of Ferocity}\n\nIn addition to the regular bonuses, the Barbarian Lord's Axe of Ferocity gives all non-shooting creatures in a hero's ranks an additional strike with each attack. This extra strike is added to the number of strikes the creature normally makes--if a creature already strikes twice, it will now strike three times. Note: even if making a melee attack, shooting creatures won't receive this bonus.",
                "event": "You pick up the Barbarian Lord's Axe of Ferocity and it speaks to your mind,\"Bring on the enemy and together we shall cut a swath of destruction through their legions!\" "
            },
            "159": {
                "name": "Dragonheart",
                "description": "{Dragonheart}\n\nThis ancient relic summons up to [100 HP x Hero Level] dragons for the duration of a battle (minimum one dragon). Dragon type is random but may be influenced by terrain.\n\nIn addition, dragons in a hero's army always have positive morale.",
                "event": "You pick up the Dragonheart and feel the powerful drum-beat of ten thousand dragon hearts reverberating through your soul. When you need them, the dragons will come."
            },
            "160": {
                "name": "Gate Key",
                "description": "{Gate Key}\n\nUpon entering a town you own, the Gate Key gives you the option to lock it for 5 days. Heroes can leave locked towns but no hero can enter except by Town Portal or Castle Gate, and the town cannot be attacked.\n\nThe Gate Key will vanish when used and returns to the hero 10 days later. A town cannot be relocked by any Gate Key for 5 days after it becomes unlocked. If a player is vanquished, their locked towns will be unlocked for all players the following day.",
                "event": "You pick up the Gate Key. With this incredible relic, you'll be able to enchant your castle gates to keep even your most powerful enemies at bay!"
            },
            "161": {
                "name": "Helmet #161",
                "description": "{Helmet (Artifact #161)}\n\nThis artifact is {BLANK} and must be programmed by ERM.",
                "event": "You pick up the Helmet: Artifact #161. This artifact is {BLANK} and must be programmed by ERM."
            },
            "162": {
                "name": "Sword #162",
                "description": "{Sword (Artifact #162)}\n\nThis artifact is {BLANK} and must be programmed by ERM.",
                "event": "You pick up the Sword: Artifact #162. This artifact is {BLANK} and must be programmed by ERM."
            },
            "163": {
                "name": "Shield #163",
                "description": "{Shield (Artifact #163)}\n\nThis artifact is {BLANK} and must be programmed by ERM.",
                "event": "You pick up the Shield: Artifact #163. This artifact is {BLANK} and must be programmed by ERM."
            },
            "164": {
                "name": "Horned Ring #164",
                "description": "{Horned Ring (Artifact #164)}\n\nThis artifact is {BLANK} and must be programmed by ERM.",
                "event": "You pick up the Horned Ring: Artifact #164. This artifact is {BLANK} and must be programmed by ERM."
            },
            "165": {
                "name": "3-Gemmed Ring #165",
                "description": "{3-Gemmed Ring (Artifact #165)}\n\nThis artifact is {BLANK} and must be programmed by ERM.",
                "event": "You pick up the 3-Gemmed Ring: Artifact #165. This artifact is {BLANK} and must be programmed by ERM."
            },
            "166": {
                "name": "Neck Broach #166",
                "description": "{Neck Broach (Artifact #166)}\n\nThis artifact is {BLANK} and must be programmed by ERM.",
                "event": "You pick up the Neck Broach: Artifact #166. This artifact is {BLANK} and must be programmed by ERM."
            },
            "167": {
                "name": "Armor #167",
                "description": "{Armor (Artifact #167)}\n\nThis artifact is {BLANK} and must be programmed by ERM.",
                "event": "You pick up the Armor: Artifact #167. This artifact is {BLANK} and must be programmed by ERM."
            },
            "168": {
                "name": "Surcoat #168",
                "description": "{Surcoat (Artifact #168)}\n\nThis artifact is {BLANK} and must be programmed by ERM.",
                "event": "You pick up the Surcoat: Artifact #168. This artifact is {BLANK} and must be programmed by ERM."
            },
            "169": {
                "name": "Boots #169",
                "description": "{Boots (Artifact #169)}\n\nThis artifact is {BLANK} and must be programmed by ERM.",
                "event": "You pick up the Boots: Artifact #169. This artifact is {BLANK} and must be programmed by ERM."
            },
            "170": {
                "name": "Horn #170",
                "description": "{Horn (Artifact #170)}\n\nThis artifact is {BLANK} and must be programmed by ERM.",
                "event": "You pick up the Horn: Artifact #170. This artifact is {BLANK} and must be programmed by ERM."
            }
        }
    }
}