{
	"RMG": {
		"text": {
			"title": "Generation Settings",
			"buttons": {
				"setup": {
					"name": "Tune...",
					"hint": "Additional settings for objects generated by a random map"
				},
				"random": {
					"rmc": "{Randomize All Objects}\n\nFor all objects that are presented in the RMG Settings dialog at the moment, completely random parameters will be set each time the map is generated. This option is controlled by clicking on this button.",
					"help": "{Attention!}\n\nYou have enabled full object randomization mode for random maps! For all objects that are currently presented in the RMG settings dialog, completely random parameters will be set each time the map is generated. This option is controlled by clicking on this button.\n\nP.S.: Have fun."
				}
			},
			"dlg": {
				"pages": [
					{
						"name": "Creature Banks",
						"hint": "Edit creature bank creation\nHotkey: \"{1}\"",
						"rmc": "{Creature Banks}\n\nRead {\"Help\"} for more information on adding and editing creature banks.",
						"help": "{Creature Bank Help}:\nYou can change current and add new Creature Banks using the following json keys required to create an object:\n\n\"{RMG.objectGeneration.16.[subtype].name}\" - sets the name of the Creature Bank. This is a string. Example value:\"Test Creature Bank\"\n\nNext, you need to set 4 Bank states, 1 of which is randomly selected for each of them at the start of the map (or using other scripts):\n\"{RMG.objectGeneration.16.[subtype].states.[stateId].artifactTypeCounts}\" - a reward from the types of artifacts given out after looting a bank - this is an array of 4 numbers responsible for the number of artifacts of different values. Example key value:[1,2,0,0];\n\n\"{RMG.objectGeneration.16.[subtype].states.[stateId].resources}\" - a reward from the types of resources issued after looting a bank - this is an array of 7 numbers responsible for the amount of resources of different types. Example key value:[1,2,0,2,0,20000];\n\n\"{RMG.objectGeneration.16.[subtype].states.[stateId].creatureRewardType}\" - the reward from the type of creature issued after robbing the bank is simply a number responsible for the id of the creature. Example key value:12;\n\n\"{RMG.objectGeneration.16.[subtype].states.[stateId].creatureRewardCount}\" - the number of creatures listed above is just a number. Example key value:12;\n\n\"{RMG.objectGeneration.16.[subtype].states.[stateId].guardians.type}\" - types of creatures guarding the object - this is an array of 7 numbers responsible for the type of creatures in each slot of the guard army. Example key value:[51,2,1,45,-1,-1,-1];\n\n\"{RMG.objectGeneration.16.[subtype].states.[stateId].guardians.count}\" - the number of creatures listed above is an array of 7 numbers. Example key value:[25,12,100,15,0,0,0];\n\n\"{RMG.objectGeneration.16.[subtype].states.[stateId].upgrade}\" - the chance of an improved creature among those listed above is just a number. Example key value:50;\n\n\"{RMG.objectGeneration.16.[subtype].states.[stateId].chance}\" - the chance for this particular state of the creature bank to appear among all 4 (the total should be 100) - it\"s just a number. Example key value:30;"
					},
					{
						"name": "General map objects",
						"hint": "Edit generation of common map objects\nHotkey: \"{2}\"",
						"rmc": "{General map objects}\n\nRead {\"Help\"} for more information about adding and editing common map objects.",
						"help": "{Help on common map objects}:\nMany of these objects have strong restrictions on the number in the zone and on the map, since each of them has an id, which is added to the bit set for each hero, so setting the value above 32 does not make sense (P.S.: I haven't tried it and I don't advise you )."
					},
					{
						"name": "Creature dwellings",
						"hint": "Edit the generation of creature dwellings on the map.\nHotkey: \"{3}\"",
						"rmc": "{Creature dwellings}\n\nRead {\"Help\"} for more information on adding and editing creature dwellings.",
						"help": "{Help on creature dwellings}:\nThe cost of these objects is calculated automatically by the game, based on the number of cities to which the creature from the dwelling belongs, and the AI ​​value of this creature.\nThis dialogue provides the basic values ​​of the value of AI creatures, from which the final value of the object is calculated at the time of its generation. The complete formula for calculating the value of creature dwellings looks like this:\n{AI_value} = creatureInfo->AI_value;\ndwellingValue = {AI_value} * creatureInfo->growth;\ntotalCreatureTypeTowns = 0;\nif ( townType != -1 )\ntotalCreatureTypeTowns = rmgStruct->townsCountByType[townType];\ntotalTownsCount = rmgStruct->townsCount;\nif ( totalTownsCount > 0 )\ndwellingValue += dwellingValue * totalCreatureTypeTowns / totalTownsCount;\n{objectValue} = dwellingValue + totalCreatureTypeTowns * {AI_value} / 2;"
					},
					{
						"name": "WoG objects (type 63)\n(Check WoG options)",
						"hint": "Edit WoG object generation\nHotkey: \"{4}\"",
						"rmc": "{WoG objects}\n\nRead {\"Help\"} for more information on adding and editing WoG objects.",
						"help": "{Help on WoG objects}:\nWoG objects (type 63) are also added via json, but all their mechanics are scripted (for now). Before including an object in generation, make sure that the corresponding object has a script or other implementation. Otherwise, an empty object will appear on the map, which will \"eat\" part of the value of the zone."
					}
				],
				"buttons": {
					"cancel": {
						"rmc": "{Cancel}\n\nClose the dialog without making changes",
						"hint": "Close dialogue without saving\nHotkeys: \"{Esc}\"/\"{S}\""
					},
					"random": {
						"rmc": "{Random}\n\nSet random settings for all objects on the current page. Please note that high object values ​​will simply prevent them from being generated in some zones.",
						"hint": "Randomize the value of objects\nHotkey: \"{R}\""
					},
					"default": {
						"rmc": "{Default}\n\nSet default settings for all objects on the current page. The values ​​are taken from the base game and json files.",
						"hint": "Reset Settings to Default\nHotkey: \"{D}\""
					},
					"help": {
						"help": "{~text align=center}{REFERENCE 1/2}}\n\nThis dialog displays and allows you to change all the values ​​for generating a list of objects that the RMG can place on the map at the time of its generation. The lists of objects preinstalled by the author of the plugin (@daemon_n) contain values ​​that directly affect the objects created by the RMG. There are currently 4 different categories, divided by type of object:\n- {Creature Banks}: allows you to receive rewards (creatures, resources, artifacts) for defeating the object's guards, you can customize the current ones and add your own (yes, yes)\n- {Standard objects}: most standard objects for all types of soil (resource warehouses have also been added at the moment - with weekly visits)\n- {Creature Habitats}: a facility where you can hire certain creatures for a fee (like in a city).\n- {WoG-Objects}: These objects have type 63 and different subtypes. In the original, these objects are not created using the RMG, but only replace others using erm scripts, but this plugin (plugin_name) allows you to add them to the list of objects for generation (and here you clap your hands).\n\n\n{~text align=center}{Brief Help for this dialogue}}\n\nAt the bottom of the dialog there are 4 functional buttons for controlling the dialog:\n\n\n- {~>RMG_okay.def:0:0 valign=bottom} Applies the changes made to the dialog, saves it to the file \"{[Game_folder]/Runtime/RMG_CustomizeObjectsProperties.ini}\" and closes the dialog\n\n\n- {~>RMG_cncl.def:0:0 valign=bottom} {CANCELS} changes made to the dialog and closes the dialog\n\n\n- {~>RanRand.def:0:0 valign=bottom} {Changes} all values ​​{ONLY} on the current dialog page\n\n\n- {~>RMG_dflt.def:0:0 valign=bottom} {Restores} all values ​​{ONLY} on the current dialog page to default values ​​(default values ​​are stored in the game itself and the json file)\n\n\n{~text align=center}{Quick Help on generating objects on a random map}}\n\nAt the moment, the plugin is able to add to the generation list Creature Banks {(type 16)}, Sanctuaries of Thought {(types 88-90)}, Resource Warehouses {(type 142)} and WoG objects {(type 63)} - subtype you specify for them (see json file), and you can edit the value for almost any object.\n\nBasic keys for adding/editing objects:\n\n\"{RMG.objectGeneration.[type].[subtype].enabled}\" - to set the general enable/disable flag from the generation list;\n\n\"{RMG.objectGeneration.[type].[subtype].value}\" - for issuing values ​​for new objects and editing existing ones;\n\n\"{RMG.objectGeneration.[type].[subtype].density}\" - for issuing generation density for new objects and editing existing ones;\n\n\"{RMG.objectGeneration.[type].[subtype].map}\" - for issuing the maximum number of new objects on the map and editing existing ones;\n\n\"{RMG.objectGeneration.[type].[subtype].zone}\" - for issuing the maximum number of new objects on the map and editing existing ones;\n\n\"{RMG.objectGeneration.[type].[subtype].name}\" - to set/change the object name (does not work with all objects yet);\n\n\"{RMG.objectGeneration.[type].[subtype].sound.enter}\" - to set/change the input sound played when visiting this object on the Adventure Map;\n\n\"{RMG.objectGeneration.[type].[subtype].sound.loop}\" - to set/change the cyclic sound played when you are near this object on the Adventure Map (does not work with all objects yet)\n\nYou can also ignore the [subtype] field in the json key, then the specified values ​​will be applied to all subtypes of this object type;\n\nPlease note that the values ​​specified in json become default for this object, therefore it is recommended to edit the values ​​directly in the GCS settings dialog.\n\n\nBelow are short guides for specific object types.",
						"rmc": "{reference}\n\nA Quick Guide to Adding and Editing Adventure Map Objects",
						"hint": "Open help dialog\nHotkey: \"{H}\""
					},
					"ok": {
						"rmc": "{Save and close}\n\nSaves the changes made and closes the dialog",
						"hint": "Save changes and close dialog\nHotkeys: \"{Enter}\"/\"{Space}\"."
					}
				},
				"hintBar": {
					"rmc": "This is a tooltip bar and there are no tooltips when you hover over it. How ironic"
				},
				"header": [
					{
						"name": "Type",
						"hint": "Column \"Object type\"\nClick to sort by object type",
						"rmc": "KB RMC",
						"help": "CB help"
					},
					{
						"name": "Object name",
						"hint": "Column \"Object name\"\nClick to sort by item name",
						"rmc": "KB RMC",
						"help": "CB help"
					},
					{
						"name": "Ticket limit",
						"hint": "Column \"Card limit\"\nClick to sort by the limit of objects on the map",
						"rmc": "KB RMC",
						"help": "CB help"
					},
					{
						"name": "Zone limit",
						"hint": "Column \"Area limitation\"\nClick to sort by object limit in the zone",
						"rmc": "Hero visiting rmc",
						"help": "Help when visiting a hero"
					},
					{
						"name": "Value",
						"hint": "Column \"Object value\"\nClick to sort by item value",
						"rmc": "Other RMC facilities",
						"help": "Other objects help"
					},
					{
						"name": "Generation density",
						"hint": "Column \"Object Density\"\nClick to sort by object density",
						"rmc": "To be announced later",
						"help": "Help to be confirmed"
					}
				],
				"objectPanel": {
					"checkbox": {
						"hint": "{Ctrl+Left Click}: Set all objects as this one.\n{Alt+left click}: Change the state of all objects."
					}
				},
				"notImplemented": "this feature is not yet implemented"
			},
			"help": {
				"body": "It is very important to know that the patient is very happy. A great saint praises dignissim. That laoreet and just delete kasd stand. Dolor vulputate veniam gubergren sed ut te sed et lorem nobis dolor. Let the pain be the burden of the accusation, let the pain be so that it receives the slightest pain, the pain is settled, the pain is erased, and the pain is relieved. Feugiat takimata dolor molestie vulputate sed laoreet eirmod lorem duis feugait diam sadipscing diam sit nibh. And it was two, but the diam, but they envy some clita, but the two governers. Who is it that you are just so worthy and so holy that you are so worthy and so holy as to be sadipscing? It is very painful to be in the environment."
			}
		}
	}
}