{
    "era": {
        "artifacts": {
            "0": {
                "name": "Книга Заклинаний",
                "description": "{Книга Заклинаний}\n\nЧтобы просмотреть заклинания, щелкните на Книге Заклинаний левой кнопкой.",
                "event": "Вы натыкаетесь на книгу заклинаний, смахиваете с нее пыль и кладете в свой рюкзак."
            },
            "1": {
                "name": "Свиток с Заклинанием",
                "description": "{Свиток с Заклинанием}\n\nВ этом свитке находится заклинание [spell name]. Оно будет включено в вашу Книгу Заклинаний, пока свиток остаётся у вас.",
                "event": "Вы находите капсулу, содержащую старый пергаментный свиток. Руны на капсуле очень древние, а украшение просто поражает воображение. Вытащив свиток, вы ощущаете, что вас наполняет магическая сила."
            },
            "2": {
                "name": "Грааль",
                "description": "{Грааль}\n\nОтнесите Грааль в любой город, чтобы его жители воздвигли строение, которые даст невероятные преимущества хозяину города.",
                "event": "Вы натыкаетесь на Грааль, смахиваете с него пыль и кладёте в свой рюкзак."
            },
            "3": {
                "name": "Катапульта",
                "description": "{Катапульта}\n\nИспользуйте эту военную машину для разрушения городских укреплений противника.",
                "event": "Вы натыкаетесь на брошенную катапульту, смахиваете с нее пыль и берёте с собой."
            },
            "4": {
                "name": "Баллиста",
                "description": "{Баллиста}\n\nИспользуйте эту военную машину против отрядов противника.",
                "event": "Вы натыкаетесь на брошенную баллисту, смахиваете с нее пыль и берёте с собой."
            },
            "5": {
                "name": "Подвода с Боеприпасами",
                "description": "{Подвода с Боеприпасами}\n\nОбеспечивает бесперебойную подачу боеприпасов стрелковым отрядам.",
                "event": "Вы натыкаетесь на подводу с боеприпасами, смахиваете с нее пыль и берёте с собой."
            },
            "6": {
                "name": "Палатка Первой Помощи",
                "description": "{Палатка Первой Помощи}\n\nВ конце каждого раунда лечит выбранное дружественное существо.",
                "event": "Вы натыкаетесь на палатку первой помощи, смахиваете с нее пыль и берёте с собой."
            },
            "7": {
                "name": "Секира Кентавра",
                "description": "{Секира Кентавра}\n\nПовышает Атаку героя на 2 балла.",
                "event": "Вы находите тяжёлую секиру, погружённую в землю по самую рукоять. После некоторых безуспешных попыток ваших воинов вы берётесь за рукоять и с лёгкостью вытаскиваете её из земли."
            },
            "8": {
                "name": "Чёрный Клинок Мёртвого Рыцаря",
                "description": "{Чёрный Клинок Мёртвого Рыцаря}\n\nПовышает Атаку героя на 3 балла.",
                "event": "Вдова бывшего капитана гвардейцев вручает вам меч своего погибшего мужа, чтобы помочь вам разгромить противника. "
            },
            "9": {
                "name": "Великий Гноллий Кистень",
                "description": "{Великий Гноллий Кистень}\n\nПовышает Атаку героя на 4 балла.",
                "event": "Неуклюжий гнолл зашиб себя собственным кистенем. Зная, что вы более опытны в обращении с этим оружием, вы незаметно берёте этот прекрасный кистень из рук погибшего."
            },
            "10": {
                "name": "Карающая Дубина Огра",
                "description": "{Карающая Дубина Огра}\n\nПовышает Атаку героя на 5 баллов.",
                "event": "В придорожной таверне к вам начинает приставать пьяный огр. Не желая причинить ему вреда, вы связываете его и забираете его огромную дубину, чтобы он не беспокоил окружающих."
            },
            "11": {
                "name": "Адский Меч",
                "description": "{Адский Меч}\n\nПовышает Атаку героя на 6 баллов.",
                "event": "Неожиданно начинается буря, молния бьёт в дерево и раскалывает его на куски. Внутри дерева вы обнаруживаете таинственный меч."
            },
            "12": {
                "name": "Гладиус Титана",
                "description": "{Гладиус Титана}\n\nПовышает Атаку героя на 12 баллов, однако снижает Защиту на 3 балла.",
                "event": "Вас останавливает титан и требует 5.000 золотых. Вы отказываетесь. Титан хватается за меч, который висит у него на поясе, однако вы успеваете проскочить у него между ног. Ваш манёвр настолько неожиданен, что он спотыкается и падает... прямо на свой меч."
            },
            "13": {
                "name": "Щит Гномьих Героев",
                "description": "{Щит Гномьих Героев}\n\nПовышает Защиту героя на 2 балла.",
                "event": "Во время исследования одной из горных шахт вы находите и освобождаете группу гномов, попавших в ловушку. В знак благодарности предводитель гномов дарит вам отлично сработанный щит."
            },
            "14": {
                "name": "Щит Тоскующих Мертвецов",
                "description": "{Щит Тоскующих Мертвецов}\n\nПовышает Защиту героя на 3 балла.",
                "event": "Ваши солдаты находят мрачную усыпальницу, посвящённую культу Смерти. Вы освящаете усыпальницу, из-за чего изображение щита над алтарем трескается. За ним вы находите настоящий щит, который вы решаете забрать из этого дьявольского места."
            },
            "15": {
                "name": "Щит Короля Гноллов",
                "description": "{Щит Короля Гноллов}\n\nПовышает Защиту героя на 4 балла.",
                "event": "Каменная статуя изображает воина, держащего щит. Когда вы берёте щит статуя разваливается на куски."
            },
            "16": {
                "name": "Щит Яростного Огра",
                "description": "{Щит Яростного Огра}\n\nПовышает Защиту героя на 5 баллов.",
                "event": "Вы переходите по мосту глубокий овраг. Неожиданно, на другой стороне моста появляется огромный, взбешенный огр, которого вам приходится убить. В качестве трофея вы берёте его щит."
            },
            "17": {
                "name": "Щит Проклятых",
                "description": "{Щит Проклятых}\n\nПовышает Защиту героя на 6 баллов.",
                "event": "Забравшись на вершину небольшого холма вы обнаруживаете забавную картину. Маленькая фея пытается нести щит, размером с нее саму. Сдерживая смех, вы спрашиваете: \"Вам помочь?\". Фея бросает взгляд в вашу сторону и отвечает: \"Ты думаешь это смешно?\""
            },
            "18": {
                "name": "Щит Часового",
                "description": "{Щит Часового}\n\nПовышает Защиту героя на 12 баллов, однако снижает Атаку на 3 балла.",
                "event": "Вы находите большой ящик, который кажется сделанным из какого-то странного метала. Когда вы коснулись его, ящик открылся. Внутри вы находите блестящий щит."
            },
            "19": {
                "name": "Шлем Белого Единорога",
                "description": "{Шлем Белого Единорога}\n\nПовышает Знание героя на 1 балл.",
                "event": "Путешествующий кузнец предлагает вам шлем с рогом единорога в обмен на провизию и воду, которых у него совсем не осталось. Вы соглашаетесь и позже узнаёте, что шлем наделен магической силой."
            },
            "20": {
                "name": "Шлем-Череп",
                "description": "{Шлем-череп}\n\nПовышает Знания героя на 2 балла.",
                "event": "Во время вашей короткой остановки на постоялом дворе вы начинаете обмениваться рассказами и, случайно, вещами. Вскоре вы обнаруживаете, что среди них есть и волшебные."
            },
            "21": {
                "name": "Шлем Хаоса",
                "description": "{Шлем Хаоса}\n\nПовышает Знание героя на 3 балла.",
                "event": "На вашу армию напало небольшое племя диких (и не особо умных) орков. Вы легко разделываетесь с ними и оставшиеся в живых враги разбегаются. Среди трофеев вы находите шлем с рогом и берёте его с собой в качестве сувенира."
            },
            "22": {
                "name": "Корона Верховного Волхва",
                "description": "{Корона Верховного Волхва}\n\nПовышает Знание героя на 4 балла.",
                "event": "Сумасшедший волшебник, терроризировавший всю округу, сегодня решил напасть на вас. Поняв, что вся его сила исходит от короны у него на голове, вы сбиваете её стрелой из лука и тем самым снимаете с него проклятье. В благодарность он позволяет вам оставить эту корону себе."
            },
            "23": {
                "name": "Шлем Сатанинской Ярости ",
                "description": "{Шлем Сатанинской Ярости}\n\nПовышает Знание героя на 5 баллов.",
                "event": "На вашу армию напало небольшое племя диких (и не особо умных) орков. Вы легко разделываетесь с ними и оставшиеся в живых враги разбегаются. Среди трофеев вы находите шлем с рогом и берёте его с собой в качестве сувенира."
            },
            "24": {
                "name": "Шлем Небесного Грома",
                "description": "{Шлем Небесного Грома}\n\nПовышает Знание героя на 10 баллов, однако снижает Колдовскую Силу на 2 балла.",
                "event": "Ваше внимание привлекает какой-то отблеск. Вы исследуете местность и под одним из кустов находите золотой шлем."
            },
            "25": {
                "name": "Нагрудник из Окаменелого Дерева",
                "description": "{Нагрудник из Окаменелого Дерева}\n\nПовышает Колдовскую Силу героя на 1 балл.",
                "event": "Шайка мародёров копается среди останков воина. Разогнав их, вы замечаете, что они обронили странный нагрудник."
            },
            "26": {
                "name": "Доспехи из Рёбер",
                "description": "{Доспехи из Рёбер}\n\nПовышает Колдовскую Силу героя на 2 балла.",
                "event": "Вы натыкаетесь на грудную клетку какого-то крупного животного. При более близком рассмотрении вы обнаруживаете, что это не просто кости, а доспехи."
            },
            "27": {
                "name": "Кольчуга Великого Василиска",
                "description": "{Кольчуга Великого Василиска}\n\nПовышает Колдовскую Силу героя на 3 балла.",
                "event": "Вы встречаете старого оружейника, который утверждает, что должен вам за что-то отплатить. Вы соглашаетесь и он, соединив вместе несколько чешуек базилиска, отдаёт вам отличные доспехи."
            },
            "28": {
                "name": "Туника Короля Циклопов",
                "description": "{Туника Короля Циклопов}\n\nПовышает Колдовскую Силу героя на 4 балла.",
                "event": "Вы застаете циклопа, купающегося голышом и, шутки ради, забираете его тунику. Позже вы узнаёте, что она волшебная."
            },
            "29": {
                "name": "Нагрудник из Серного Камня",
                "description": "{Нагрудник из Серного Камня}\n\nПовышает Колдовскую Силу героя на 5 баллов.",
                "event": "Вы встречаете кузнеца, который плавит остатки старых доспехов и оружия, чтобы получить железо для новых изделий. Он узнаёт о вашем походе и отдаёт вам нагрудник, который не плавился, и, следовательно, не был ему нужен. "
            },
            "30": {
                "name": "Латы Титана",
                "description": "{Латы Титана}\n\nПовышают Колдовскую Силу героя на 10 баллов, однако снижают Знание на 2 балла.",
                "event": "Вас останавливает титан и требует 5000 золотых. Вы отказываетесь. Титан хватается за меч, который висит у него на поясе, однако вы успеваете проскочить у него между ног. Ваш манёвр настолько неожиданен, что он спотыкается и падает...  прямо на свой меч."
            },
            "31": {
                "name": "Магические Доспехи",
                "description": "{Магические Доспехи}\n\nПовышают все четыре основных навыка героя на 1 балл.",
                "event": "Шайка бродяг роется в вещах погибших воинов. После того, как вы спугнули их вы обнаруживаете, что они не заметили грязные, но надежные доспехи на одном из погибших. "
            },
            "32": {
                "name": "Сандалии Святых",
                "description": "{Сандалии Святых}\n\nПовышают все четыре основных навыка героя на 2 балла.",
                "event": "Вы помогаете торговцу-кочевнику избавиться от нападок гоблинов. В знак благодарности он дарит вам пару искусно сделанных сандалий из очень мягкой кожи. При более близком рассмотрении вы обнаруживаете, что на них нанесены древние руны. "
            },
            "33": {
                "name": "Ожерелье Божественной Благодати",
                "description": "{Ожерелье Божественной Благодати}\n\nПовышает все четыре основных навыка героя на 3 балла.",
                "event": "Вы спасаете волшебницу из заколдованной могилы, за что она награждает вас изысканным ожерельем с бриллиантами."
            },
            "34": {
                "name": "Щит Львиной Храбрости",
                "description": "{Щит Львиной Храбрости}\n\nПовышает все четыре основных навыка героя на 4 балла.",
                "event": "Вы становитесь свидетелем схватки паладина и некроманта. Последний почти одолел паладина, но вы вмешались и поразили служителя зла. В знак благодарности паладин дарует вам щит, спасший его."
            },
            "35": {
                "name": "Меч Правосудия",
                "description": "{Меч Правосудия}\n\nПовышает все четыре основных навыка героя на 5 баллов.",
                "event": "Вы оказываетесь на поле боя, на котором смертельно раненый паладин отбивается от нескольких зомби. Умирая он отдаёт вам свой меч с просьбой закончить его дело. Когда вы берёте меч он начинает гудеть, а ваш взор затмевает пелена. Придя в себя вы обнаруживаете, что меч в крови, а все зомби мертвы. Вы кладете меч в ножны"
            },
            "36": {
                "name": "Шлем Божественного Просвещения",
                "description": "{Шлем Божественного Просвещения}\n\nПовышает все четыре основных навыка героя на 6 баллов.",
                "event": "Вы замечаете какой-то светящийся предмет, выступающий из земли. Вы посылаете одного из ваших солдат осмотреть это место. Вскоре он возвращается с золотым шлемом в руках. Вы догадываетесь, что это золотой Шлем Божественного Просвещения."
            },
            "37": {
                "name": "Неподвижный Глаз Дракона",
                "description": "{Неподвижный Глаз Дракона}\n\nПовышает Атаку и Защиту героя на 1 балл.",
                "event": "В одной из ветхих избушек вы обнаруживаете скелет давно умершей ведьмы. При более детальном рассмотрении вы обнаруживаете кольцо с глазом дракона."
            },
            "38": {
                "name": "Языки Пламени Красного Дракона",
                "description": "{Языки Пламени Красного Дракона}\n\nПовышают Атаку и Защиту героя на 2 балла.",
                "event": "В одном из узких лестных проходов неожиданно вспыхивает куст. Прямо на ваших глазах пламя принимает форму прекрасной женщины. Она вручает вам великолепный меч."
            },
            "39": {
                "name": "Щит из Чешуи Дракона",
                "description": "{Щит из Чешуи Дракона}\n\nПовышает Атаку и Защиту героя на 3 балла.",
                "event": "Вы встречаете старого оружейника, который утверждает, что должен вам за что-то отплатить. Вы соглашаетесь и он, соединив вместе несколько чешуек дракона, отдаёт вам отличный щит."
            },
            "40": {
                "name": "Доспехи из Чешуи Дракона",
                "description": "{Доспехи из Чешуи Дракона}\n\nПовышают Атаку и Защиту героя на 4 балла.",
                "event": "Вы встречаете старого оружейника, который утверждает, что должен вам за что-то отплатить. Вы соглашаетесь и он, соединив вместе несколько чешуек дракона, отдаёт вам отличные доспехи."
            },
            "41": {
                "name": "Наколенники из Драконьей Кости",
                "description": "{Наколенники из Драконьей Кости}\n\nПовышают Колдовскую Силу и Знание героя на 1 балл.",
                "event": "Вы натыкаетесь на кости какого-то крупного животного, скорее всего - дракона. При более близком рассмотрении вы обнаруживаете, что это не просто кости, а наголенники."
            },
            "42": {
                "name": "Плащ из Драконьих Крыльев",
                "description": "{Плащ из Драконьих Крыльев}\n\nПовышает Колдовскую Силу и Знание героя на 2 балла.",
                "event": "За освобождение окрестностей от злобного дракона, который развлекался пожирая рыцарей, вас награждают плащом из крыльев дракона."
            },
            "43": {
                "name": "Ожерелье из Зубов Дракона",
                "description": "{Ожерелье из Зубов Дракона}\n\nПовышает Колдовскую Силу и Знание героя на 3 балла.",
                "event": "Вы встречаете старого шамана, который стоит на дороге и что-то кричит вам на непонятном языке. Неожиданно он исчезает в клубе дыма. Вы подходите ближе и обнаруживаете ожерелье из клыков дракона на месте, где он стоял."
            },
            "44": {
                "name": "Корона из Зубов Дракона",
                "description": "{Корона из Зубов Дракона}\n\nПовышает Колдовскую Силу и Знание героя на 4 балла.",
                "event": "Во время охоты вы находите корону, каким-то образом висящую в воздухе. Подойдя ближе вы замечаете надпись: \"Разум есть сила, а магия - власть. Слушай меня - я не дам тебе пасть\"."
            },
            "45": {
                "name": "Застывший Глаз Дракона",
                "description": "{Застывший Глаз Дракона}\n\nПовышает Боевой Дух и Удачу героя на 1 балл.",
                "event": "В одной из ветхих избушек вы обнаруживаете скелет давно умершей ведьмы. При более детальном рассмотрении вы обнаруживаете кольцо с глазом дракона."
            },
            "46": {
                "name": "Клевер Удачи",
                "description": "{Клевер Удачи}\n\nПовышает Удачу героя на 1 балл.",
                "event": "Проходя по высохшему полю вы с удивлением обнаруживаете четырёхлистный клевер, которого совсем не затронула засуха."
            },
            "47": {
                "name": "Карты Пророчества",
                "description": "{Карты Пророчества}\n\nПовышают Удачу героя на 1 балл.",
                "event": "Вы встречаете путешественника, который предлагает вам выбрать любую из странных карт, колоду которых он несёт с собой. Когда вы отказываетесь он сам вытаскивает карту. Он смотрит на карту, затем с удивлением на вас и, бросив карты, исчезает. Вы собираете их."
            },
            "48": {
                "name": "Голубка Удачи",
                "description": "{Голубка Удачи}\n\nПовышает Удачу героя на 1 балл.",
                "event": "Старая ведьма, которая по всей видимости ожидала вашего появления, отдаёт вам маленькую статуэтку и уходит, не сказав ни слова."
            },
            "49": {
                "name": "Значок Смелости",
                "description": "{Значок Смелости}\n\nПовышает Боевой Дух героя на 1 балл и дает иммунитет от вражеских заклинаний разума.",
                "event": "Вы спасаете маленького мальчика от стаи злобных волков и возвращаете его в поместье родителей. Благодарный отец награждает вас медалью - За Отвагу."
            },
            "50": {
                "name": "Герб Доблести",
                "description": "{Герб Доблести}\n\nПовышает Боевой Дух героя на 1 балл.",
                "event": "Вы спасаете принцессу близлежащего королевства от работорговцев, за что она награждает вас Гербом Доблести."
            },
            "51": {
                "name": "Знак Отваги",
                "description": "{Знак Отваги}\n\nПовышает Боевой Дух героя на 1 балл.",
                "event": "За освобождение окрестностей от злостного минотавра, который развлекался пожирая рыцарей, вас награждают Знаком Отваги."
            },
            "52": {
                "name": "Телескоп",
                "description": "{Телескоп}\n\nУвеличивает радиус обзора героя на 1 балл.",
                "event": "Торговец из далеких стран продаёт вам новое изобретение своего народа, помогающее при путешествиях. Оно позволяет зрительно приближать удалённые объекты. Он называет его... Зеркало."
            },
            "53": {
                "name": "Подзорная Труба",
                "description": "{Подзорная Труба}\n\nУвеличивает радиус обзора героя на 1 балл.",
                "event": "Старик-изобретатель предлагает вам опробовать его последнюю разработку. Он называет его... Подзорная Труба."
            },
            "54": {
                "name": "Амулет Гробовщика",
                "description": "{Амулет Гробовщика}\n\nУсиливает вторичный навык Некромантии, если он есть у героя, на 5%.",
                "event": "Неподалеку от только что вырытой могилы вы находите грязный амулет. При более близком рассмотрении вы обнаруживаете, что это магический Амулет Гробовщика, который давно был утерян."
            },
            "55": {
                "name": "Мантия Вампира",
                "description": "{Мантия Вампира}\n\nУсиливает вторичный навык Некромантии, если он есть у героя, на 10%.",
                "event": "Вы обнаружили дневное убежище вампира и с лёгкостью разделались с ним. Чтобы не быть голословным в своих рассказах вы берёте его сутану."
            },
            "56": {
                "name": "Сапоги Мертвеца",
                "description": "{Сапоги Мертвеца}\n\nУсиливает вторичный навык Некромантии, если он есть у героя, на 15%.",
                "event": "Вы находите пару изящно украшенных сапог. Помянув добрым словом неизвестного покровителя, вы забираете сапоги с собой."
            },
            "57": {
                "name": "Колье Неприступности",
                "description": "{Колье Неприступности}\n\nУсиливает вторичный навык Сопротивление, если он есть у героя, на 5%.",
                "event": "Вы становитесь свидетелем схватки паладина и некроманта. Некромант произнес заклинание огненного заряда, которое повергло паладина на колени. Действуя быстро, вы уничтожили злодея перед финальным ударом. Благодарный паладин дает вам доспех, который спас его."
            },
            "58": {
                "name": "Мантия Равновесия",
                "description": "{Мантия Равновесия}\n\nУсиливает вторичный навык Сопротивление, если он есть у героя, на 10%.",
                "event": "Вы становитесь свидетелем схватки паладина и некроманта. Некромант произнес заклинание огненного заряда, которое повергло паладина на колени. Действуя быстро, вы уничтожили злодея перед финальным ударом. Благодарный паладин дает вам плащ, который спас его."
            },
            "59": {
                "name": "Сапоги Противодействия",
                "description": "{Сапоги Противодействия}\n\nУсиливают вторичный навык Сопротивление, если он есть у героя, на  15%.",
                "event": "Вы помогаете торговцу-кочевнику избавиться от нападок гоблинов. В знак благодарности он дарит вам пару искусно сделанных сапог из очень мягкой кожи. При более близком рассмотрении вы обнаруживаете, что на них нанесены древние руны. "
            },
            "60": {
                "name": "Эльфийский Лук из Вишнёвого Дерева",
                "description": "{Эльфийский Лук из Вишнёвого Дерева}\n\nУсиливает вторичный навык Меткость, если он есть у героя, на 5%.",
                "event": "Случайная встреча с известным лучником заканчивается состязанием по борьбе на пальцах. На кон ставятся ваша лошадь и его лук. Вы побеждаете."
            },
            "61": {
                "name": "Тетива из Волоса Гривы Единорога",
                "description": "{Тетива из Волоса Гривы Единорога}\n\nУсиливает вторичный навык Меткость, если он есть у героя, на 10%.",
                "event": "Вы находите единорога, попавшего в западню. Пытаясь успокоить испуганное животное вы освобождаете его и оно мгновенно скрывается из виду. Вы замечаете, что на месте Единорога осталась отличная тетива для лука."
            },
            "62": {
                "name": "Стрелы из Ангельских Перьев",
                "description": "{Стрелы из Ангельских Перьев}\n\nУсиливает вторичный навык Меткость, если он есть у героя, на 15%.",
                "event": "Не мучаясь угрызениями совести по поводу судьбы ангела, чьи перья использованы для изготовления этих стрел, вы берёте их с собой и быстро покидаете это место."
            },
            "63": {
                "name": "Птица Познания",
                "description": "{Птица Познания}\n\nУсиливает вторичный навык Орлиный Глаз, если он есть у героя, на 5%.",
                "event": "Старая ведьма, которая по всей видимости ожидала вашего появления, отдаёт вам маленькую статуэтку и уходит, не сказав ни слова."
            },
            "64": {
                "name": "Бесстрашный Хранитель",
                "description": "{Бесстрашный Хранитель}\n\nУсиливает вторичный навык Орлиный Глаз, если он есть у героя, на 10%.",
                "event": "Старая ведьма, которая по всей видимости ожидала вашего появления, отдаёт вам маленькую статуэтку и уходит, не сказав ни слова."
            },
            "65": {
                "name": "Символ Знаний",
                "description": "{Символ Знаний}\n\nУсиливает вторичный навык Орлиный Глаз, если он есть у героя, на 15%.",
                "event": "Старая ведьма, которая по всей видимости ожидала вашего появления, отдаёт вам маленький талисман и уходит, не сказав ни слова."
            },
            "66": {
                "name": "Медаль Дипломата",
                "description": "{Медаль Дипломата}\n\nСнижает цену, уплачиваемую при капитуляции, на 10%.",
                "event": "Вы помогаете послу разобраться с поломкой его повозки. В знак благодарности он дарит вам медаль, обладающую магическими свойствами. При этом он говорит: \"Она позволит вам доказать другим вашу точку зрения\"."
            },
            "67": {
                "name": "Кольцо Дипломата",
                "description": "{Кольцо Дипломата}\n\nСнижает цену, уплачиваемую при капитуляции, на 10%.",
                "event": "Вы помогаете послу разобраться с поломкой его повозки. В знак благодарности он дарит вам кольцо, обладающее магическими свойствами. При этом он говорит: \"Оно позволит вам доказать другим вашу точку зрения\"."
            },
            "68": {
                "name": "Лента Посла",
                "description": "{Лента Посла}\n\nСнижает цену, уплачиваемую при капитуляции, на 10%.",
                "event": "Вы помогаете послу разобраться с поломкой его повозки. В знак благодарности он дарит вам ленту, обладающую магическими свойствами. При этом он говорит: \"Она позволит вам доказать другим вашу точку зрения\"."
            },
            "69": {
                "name": "Кольцо Странника",
                "description": "{Кольцо Странника}\n\nПовышает скорость всех ваших войск во время боя на 1 балл.",
                "event": "При встрече с местным мудрецом вы рассказываете ему о цели вашего путешествия. Он открывает свой мешок и достаёт оттуда странное кольцо, которое затем передаёт вам."
            },
            "70": {
                "name": "Перчатки Всадника",
                "description": "{Перчатки Всадника}\n\nУвеличивают дальность передвижения героя по суше на 300 единиц.",
                "event": "Во время вашей короткой остановки на постоялом дворе вы начинаете обмениваться рассказами и, случайно, вещами. Вскоре вы обнаруживаете, что среди них есть волшебные перчатки."
            },
            "71": {
                "name": "Ожерелье Морского Провидения",
                "description": "{Ожерелье Морского Провидения}\n\nУвеличивает дальность передвижения героя по морю на 1000 единиц.",
                "event": "Вы освобождаете старого капитана, которого мучили огры. Он дарит вам ожерелье, которое поможет вам в морских путешествиях."
            },
            "72": {
                "name": "Крылья Ангела",
                "description": "{Крылья Ангела}\n\nПозволяют герою летать. Снимают все штрафы перемещения, связанные с типом местности.",
                "event": "Не мучаясь угрызениями совести по поводу судьбы ангела, крылья которого вы нашли, вы берёте их с собой и быстро покидаете это место."
            },
            "73": {
                "name": "Амулет Маны",
                "description": "{Амулет Маны}\n\nВосстанавливает 1 дополнительную единицу маны в день.",
                "event": "Вы встречаете караван цыган, которые устроили пир. Подогретые спиртным, они подзывают вас и говорят: \"Если ты сможешь станцевать Рама-Буту, то мы наградим тебя\". Этот танец вам неизвестен, но вы всё равно пытаетесь что-то изобразить. Все падают со смеха, но за смелость вы получаете странный амулет"
            },
            "74": {
                "name": "Талисман Маны",
                "description": "{Талисман Маны}\n\nВосстанавливает 2 дополнительных единицы маны в день.",
                "event": "Вы встречаете караван цыган, которые устроили пир. Подогретые спиртным, они подзывают вас и говорят: \"Если ты сможешь станцевать Рама-Буту, то мы наградим тебя\". Этот танец вам неизвестен, но вы всё равно пытаетесь что-то изобразить. Все падают со смеха,  но за смелость вы получаете странный талисман."
            },
            "75": {
                "name": "Магическая Медаль Маны",
                "description": "{Магическая Медаль Маны}\n\nВосстанавливает 3 дополнительных единицы маны в день.",
                "event": "Вы встречаете караван цыган, которые устроили пир. Подогретые спиртным, они подзывают вас и говорят: \"Если ты сможешь станцевать Рама-Буту, то мы наградим тебя\". Этот танец вам неизвестен, но вы всё равно пытаетесь что-то изобразить. Все падают со смеха,  но за смелость вы получаете странную сферу."
            },
            "76": {
                "name": "Магическое Ожерелье",
                "description": "{Магическое Ожерелье}\n\nУвеличивает продолжительность всех ваших заклинаний на 1 раунд.",
                "event": "Вы находите стеклянный ящик, каким-то образом висящий в воздухе. Внутри вы видите золотой воротник. При прикосновении ящик открывается и воротник летит к вам."
            },
            "77": {
                "name": "Магическое Кольцо",
                "description": "{Магическое Кольцо}\n\nУвеличивает продолжительность всех ваших заклинаний на 2 раунда.",
                "event": "Вы находите небольшое дерево, которое чем-то похоже на колдуна Бримстона, на одном из ветвей которого вы видите кольцо. Обрывки одежды наводят вас на мысль, что это и есть Бримстон, только заколдованный. Вы берёте кольцо с собой. "
            },
            "78": {
                "name": "Магическая Накидка",
                "description": "{Магическая Накидка}\n\nУвеличивает продолжительность всех ваших заклинаний на 3 раунда.",
                "event": "Вы находите стеклянный ящик, каким-то образом висящий в воздухе. Внутри вы видите аккуратно сложенный плащ. При прикосновении ящик открывается и плащ летит к вам."
            },
            "79": {
                "name": "Сфера Небесного Свода",
                "description": "{Сфера Небесного Свода}\n\nУвеличивает силу заклинаний Школы \nМагии Воздуха на 50%.",
                "event": "Вы встречаете фокусника, который умоляет вас взять его с собой, чтобы быть в безопасности. Вы соглашаетесь и он отдаёт вам в качестве оплаты таинственную Сферу Элементов."
            },
            "80": {
                "name": "Сфера Илистого Озера",
                "description": "{Сфера Илистого Озера}\n\nУвеличивает силу заклинаний Школы \nМагии Земли на 50%.",
                "event": "Вы встречаете фокусника, который умоляет вас взять его с собой, чтобы быть в безопасности. Вы соглашаетесь и он отдаёт вам в качестве оплаты таинственную Сферу Элементов."
            },
            "81": {
                "name": "Сфера Бушующего Огня",
                "description": "{Сфера Бушующего Огня}\n\nУвеличивает силу заклинаний Школы \nМагии Огня на 50%.",
                "event": "Вы встречаете фокусника, который умоляет вас взять его с собой, чтобы быть в безопасности. Вы соглашаетесь и он отдаёт вам в качестве оплаты таинственную Сферу Элементов."
            },
            "82": {
                "name": "Сфера Проливного Дождя",
                "description": "{Сфера Проливного Дождя}\n\nУвеличивает силу заклинаний Школы \nМагии Воды на 50%.",
                "event": "Вы встречаете фокусника, который умоляет вас взять его с собой, чтобы быть в безопасности. Вы соглашаетесь и он отдаёт вам в качестве оплаты таинственную Сферу Элементов."
            },
            "83": {
                "name": "Плащ Отречения",
                "description": "{Плащ Отречения}\n\nВо время боя запрещает вам и вашему противнику использовать Магию 3-го уровня и выше.",
                "event": "Вы слышите крики о помощи и вскоре видите как молодая женщина убегает от медведя. Вы мгновенно убиваете зверюгу и благодарная волшебница создаёт магический плащ из его шкуры."
            },
            "84": {
                "name": "Дух Уныния",
                "description": "{Дух Уныния}\n\nВо время боя отнимает у вас и у вашего противника все положительные бонусы Боевого Духа.",
                "event": "Во время исследования руин древнего города с крепостными стенами вы находите оружие, уничтожившее его - Дух Уныния."
            },
            "85": {
                "name": "Песочные Часы Недоброго Часа",
                "description": "{Песочные Часы Недоброго Часа}\n\nВо время боя отнимает у вас и у вашего противника все положительные бонусы Удачи.",
                "event": "За очередным поворотом дороги вы натыкаетесь на страшную картину - поле боя с останками воинов, пожираемых хищниками. Вы осматриваете вещи погибших и находите песочные часы."
            },
            "86": {
                "name": "Фолиант Магии Огня",
                "description": "{Фолиант Магии Огня}\n\nСодержит все заклинания Школы Магии Огня.",
                "event": "Вы встречаете фокусника, который умоляет вас взять его с собой, чтобы быть в безопасности. Вы соглашаетесь и он отдаёт вам в качестве оплаты копию Книги Элементов."
            },
            "87": {
                "name": "Фолиант Магии Воздуха",
                "description": "{Фолиант Магии Воздуха}\n\nСодержит все заклинания Школы Магии Воздуха.",
                "event": "Вы встречаете фокусника, который умоляет вас взять его с собой, чтобы быть в безопасности. Вы соглашаетесь и он отдаёт вам в качестве оплаты копию Книги Элементов."
            },
            "88": {
                "name": "Фолиант Магии Воды",
                "description": "{Фолиант Магии Воды}\n\nСодержит все заклинания Школы Магии Воды.",
                "event": "Вы встречаете фокусника, который умоляет вас взять его с собой, чтобы быть в безопасности. Вы соглашаетесь и он отдаёт вам в качестве оплаты копию Книги Элементов."
            },
            "89": {
                "name": "Фолиант Магии Земли",
                "description": "{Фолиант Магии Земли}\n\nСодержит все заклинания Школы Магии Земли.",
                "event": "Вы встречаете фокусника, который умоляет вас взять его с собой, чтобы быть в безопасности. Вы соглашаетесь и он отдаёт вам в качестве оплаты копию Книги Элементов."
            },
            "90": {
                "name": "Сапоги Левитации",
                "description": "{Сапоги Левитации}\n\nПозволяют герою ходить по воде.",
                "event": "При встрече с местным мудрецом вы рассказываете ему о цели вашего путешествия. Он открывает свой сундук и достаёт оттуда пару странных ботинок, которые он затем передаёт вам."
            },
            "91": {
                "name": "Золотой Лук",
                "description": "{Золотой Лук}\n\nПозволяет вашим стрелковым отрядам стрелять без штрафов за дальность и препятствия.",
                "event": "Случайная встреча с известным лучником заканчивается состязанием по борьбе на пальцах. На кон ставятся ваша лошадь и его лук. Вы победили."
            },
            "92": {
                "name": "Шар Постоянства",
                "description": "{Шар Постоянства}\n\nНаделяет ваши отряды невосприимчивостью к Снятию Заклинаний.",
                "event": "Вы встречаете своего старого друга - волшебника. Он дарит вам подарок: шар, позволяющий защитить ваших людей от воздействия заклинания \"Снятие заклинаний\"."
            },
            "93": {
                "name": "Медаль Уязвимости",
                "description": "{Медаль Уязвимости}\n\nНейтрализует естественные иммунитеты к Магии у всех существ на поле боя.",
                "event": "Вы встречаете своего старого друга - волшебника. Он дарит вам подарок: шар, позволяющий воздействовать на создания, которые обычно невосприимчивы к магии.  "
            },
            "94": {
                "name": "Кольцо Жизненной Силы",
                "description": "{Кольцо Жизненной Силы}\n\nПовышает уровень здоровья всех ваших отрядов на 1 балл.",
                "event": "На привале вы замечаете как рысь пытается добраться до гнезда вороны на дереве. Не задумываясь вы сами взбираетесь на дерево и прогоняете хищника. Между тем в самом гнезде вы находите несколько блестящих камешков и кольцо."
            },
            "95": {
                "name": "Кольцо Жизни",
                "description": "{Кольцо жизни}\n\nПовышает уровень здоровья всех ваших отрядов на 1 балл.",
                "event": "На привале вы замечаете как рысь пытается добраться до гнезда вороны на дереве. Не задумываясь вы сами взбираетесь на дерево и прогоняете хищника. Между тем в самом гнезде вы находите несколько блестящих камешков и кольцо."
            },
            "96": {
                "name": "Склянка Жизненной Силы",
                "description": "{Склянка Жизненной Силы}\n\nПовышает уровень здоровья всех ваших отрядов на 2 балла.",
                "event": "В гуще деревьев вы находите таинственную усыпальницу. В воздухе над алтарем висит чаша, в которой якобы находится кровь жизни. Вы аккуратно забираете её, стараясь не привлекать к себе дополнительного внимания."
            },
            "97": {
                "name": "Ожерелье Стремительности",
                "description": "{Ожерелье Стремительности}\n\n Повышает скорость всех ваших войск во время боя на 1 балл.",
                "event": "При встрече с местным мудрецом вы рассказываете ему о цели вашего путешествия. Он открывает свой мешок и достаёт оттуда странное ожерелье, которое затем он передаёт вам."
            },
            "98": {
                "name": "Сапоги-Скороходы",
                "description": "{Сапоги-скороходы}\n\nУвеличивают дальность передвижения героя по суше на 600 единиц.",
                "event": "При встрече с местным мудрецом вы рассказываете ему о цели вашего путешествия. Он открывает свой сундук и достаёт оттуда пару странных ботинок, которые он затем передаёт вам."
            },
            "99": {
                "name": "Накидка Скорости",
                "description": "{Накидка Скорости}\n\nПовышает скорость всех ваших войск во время боя на 2 балла.",
                "event": "Во время вашей короткой остановки на постоялом дворе вы начинаете обмениваться рассказами и, случайно, вещами. Вскоре вы обнаруживаете, что в вашем новом мешке находится волшебный плащ."
            },
            "100": {
                "name": "Брелок Бесстрастия",
                "description": "{Брелок Бесстрастия}\n\nДелает ваши отряды невосприимчивыми к заклинанию Берсерк.",
                "event": "Вы слышите звуки боя и вскоре видите сражающихся - варвара и восьмиглавую гидру. Ваше своевременное вмешательство склоняет чашу весов в пользу человека, за что он награждает вас кулоном, который помогал ему подготовиться к сражению."
            },
            "101": {
                "name": "Брелок Ясновидения",
                "description": "{Брелок Ясновидения}\n\nДелает ваши отряды невосприимчивыми к заклинанию Слепота.",
                "event": "Вы находите умирающей старую, слепую женщину и помогаете ей спокойно отойти в мир иной, обещая также похоронить её. В знак благодарности она отдаёт вам кулон, позволяющий видеть с закрытыми глазами."
            },
            "102": {
                "name": "Священный Брелок",
                "description": "{Священный Брелок}\n\nДелает ваши отряды невосприимчивыми к заклинанию Проклятия.",
                "event": "В своих путешествиях вы находите маленькую избушку отшельника. Поражённый вашей смелостью он благословляет вас и даёт вам амулет, защищающий от проклятий."
            },
            "103": {
                "name": "Брелок Жизни",
                "description": "{Брелок Жизни}\n\nДелает ваши отряды невосприимчивыми к заклинанию Волна Смерти.",
                "event": "Сильная буря срывает растительность со скрытого входа в гробницу. Вы обнаруживаете, что её уже разграбили, однако при этом воры не заметили спрятанную золотую цепь."
            },
            "104": {
                "name": "Брелок Смерти",
                "description": "{Брелок Смерти}\n\nДелает ваши отряды невосприимчивыми к заклинанию Уничтожить Нежить.",
                "event": "После недолгой, но жестокой битвы с некромантом вы завладеваете его волшебным амулетом. Позже вы узнаёте, что он позволяет вам защитить ваших солдат-мертвецов от заклинаний, которые направлены на них. "
            },
            "105": {
                "name": "Брелок Свободы",
                "description": "{Брелок Свободы}\n\nДелает ваши отряды невосприимчивыми к заклинанию Гипноз.",
                "event": "Вы встречаете небольшой караван. Выиграв у одного из торговцев борьбе на пальцах, вы завладеваете его волшебным амулетом. Бывший владелец говорит вам, что он помогает противостоять гипнозу."
            },
            "106": {
                "name": "Брелок Отрицательности",
                "description": "{Брелок Отрицательности}\n\nДелает ваши отряды невосприимчивыми к заклинаниям Удар Молнии и Цепная Молния.",
                "event": "Вы находите остатки небольшой избушки, которая была явно разрушена ударом молнии. При более близком осмотре вы находите амулет, который слегка дрожит в вашей руке."
            },
            "107": {
                "name": "Брелок Абсолютной Памяти",
                "description": "{Брелок Абсолютной Памяти}\n\nДелает ваши отряды невосприимчивыми к заклинанию Забывчивости.",
                "event": "Неподалеку от остатков сожжённой ведьмы вы находите прекрасный амулет. Вы осторожно подбираете его и кладете в свой мешок. "
            },
            "108": {
                "name": "Брелок Смелости",
                "description": "{Брелок Смелости}\n\nПовышает Удачу и Боевой Дух героя на 3 балла.",
                "event": "Вы слышите крики о помощи и вскоре обнаруживаете водных фей, которые ради развлечения топят человека. В ярости, вы спасаете беднягу и хватаете одну из фей. Оказавшись вне воды фея просит вас отпустить её и отдает вам волшебный амулет."
            },
            "109": {
                "name": "Плащ Бесконечных Кристаллов",
                "description": "{Плащ Бесконечных Кристаллов}\n\nПриносит 1 кристалл каждый день.",
                "event": "Укрываясь от дождя в одной из пещер вы находите россыпь кристаллов. При более близком рассмотрении вы обнаруживаете, что это плащ, покрытый кристаллами, которые вновь и вновь появляются на нём, если их оторвать от плаща. Вы берёте его с собой."
            },
            "110": {
                "name": "Кольцо Драгоценных Камней",
                "description": "{Кольцо Драгоценных Камней}\n\nПриносит 1 драгоценный камень каждый день.",
                "event": "Вы слышите крик о помощи и вскоре обнаруживаете кентавра, попавшего в ловушку. В знак благодарности за освобождение он дарит вам мешочек, в котором вы находите изумительное кольцо с бриллиантами."
            },
            "111": {
                "name": "Неиссякаемая Склянка Ртути",
                "description": "{Неиссякаемая Склянка Ртути}\n\nПриносит дополнительную единицу ртути каждый день.",
                "event": "При кратком осмотре башни волшебника, которую почему-то оставили без присмотра, вы находите колбу со ртутью, в которой всегда остаётся немного жидкости на дне. Понимая всю ценность этой вещи вы забираете ее с собой. "
            },
            "112": {
                "name": "Неистощимая Подвода с Рудой",
                "description": "{Неистощимая Подвода с Рудой}\n\nПриносит дополнительную единицу руды каждый день.",
                "event": "Вы находите гоблинскую кузницу, в которой делают оружие для войны с людьми. Вы нападаете на их лагерь и завладеваете волшебной тачкой, в которой никогда не кончается руда. "
            },
            "113": {
                "name": "Вечное Кольцо Серы",
                "description": "{Вечное Кольцо Серы}\n\nПриносит дополнительную единицу серы каждый день.",
                "event": "Вы посещаете алхимика, который узнав о вашем походе, желает примкнуть к вам. Ваш новый подчинённый вручает вам кольцо серы, чтобы помочь вам в войне."
            },
            "114": {
                "name": "Неистощимая Подвода Леса",
                "description": "{Неистощимая Подвода Леса}\n\nПриносит дополнительную единицу древесины каждый день.",
                "event": "Вы остановились на привал и разожгли костёр. Подкладывая дрова из оказавшейся поблизости подводы вы обнаруживаете, что они появляются там вновь и вновь. Вы забираете с собой эту полезную магическую вещь. "
            },
            "115": {
                "name": "Неиссякаемый Мешок Золота",
                "description": "{Неиссякаемый Мешок Золота}\n\nПриносит 1000 золотых каждый день.",
                "event": "Вы обнаруживаете лепрекона, радостно танцующего вокруг волшебного мешка. Увидев вас ему ничего не остаётся кроме бегства. Вы забираете мешок. "
            },
            "116": {
                "name": "Неиссякаемая Сума Золота",
                "description": "{Неиссякаемая Сума Золота}\n\nПриносит 750 золотых каждый день.",
                "event": "Женщина из знатного рода, отставшая от своих спутников, просит вас помочь ей добраться до дома. В конце вашего путешествия она вручает вам мешок с золотом. "
            },
            "117": {
                "name": "Неиссякаемая Мошна Золота",
                "description": "{Неиссякаемая Мошна Золота}\n\nПриносит 500 золотых каждый день.",
                "event": "Вы находите кожаный кошель, набитый золотом. Позже вы узнаёте, что он принадлежал великому королю-воителю, который мог превратить любой предмет в золото."
            },
            "118": {
                "name": "Ноги Легиона",
                "description": "{Ноги Легиона}\n\nПри использовании героем в городе и только для данного города каждую неделю увеличивают число производимых существ \n2 уровня на 5.",
                "event": "Обыскивая развалины вы с удивлением обнаруживаете часть Статуи Легиона. Вы аккуратно смахиваете с неё пыль перед тем как положить ее в ваш мешок."
            },
            "119": {
                "name": "Поясница Легиона",
                "description": "{Поясница Легиона}\n\nПри использовании героем в городе и только для данного города каждую неделю увеличивают число производимых существ \n3 уровня на 4.",
                "event": "Обыскивая развалины вы с удивлением обнаруживаете часть Статуи Легиона. Вы аккуратно смахиваете с неё пыль перед тем как положить ее в ваш мешок."
            },
            "120": {
                "name": "Туловище Легиона",
                "description": "{Туловище Легиона}\n\nПри использовании героем в городе и только для данного города каждую неделю увеличивают число производимых существ \n4 уровня на 3.",
                "event": "Обыскивая развалины вы с удивлением обнаруживаете часть Статуи Легиона. Вы аккуратно смахиваете с неё пыль перед тем как положить ее в ваш мешок."
            },
            "121": {
                "name": "Руки Легиона",
                "description": "{Руки Легиона}\n\nПри использовании героем в городе и только для данного города каждую неделю увеличивают число производимых существ \n5 уровня на 2.",
                "event": "Обыскивая развалины вы с удивлением обнаруживаете часть Статуи Легиона. Вы аккуратно смахиваете с неё пыль перед тем как положить ее в ваш мешок."
            },
            "122": {
                "name": "Голова Легиона",
                "description": "{Голова Легиона}\n\nПри использовании героем в городе и только для данного города каждую неделю увеличивают число производимых существ \n6 уровня на 1.",
                "event": "Обыскивая развалины вы с удивлением обнаруживаете часть Статуи Легиона. Вы аккуратно смахиваете с неё пыль перед тем как положить ее в ваш мешок."
            },
            "123": {
                "name": "Шляпа Морского Капитана",
                "description": "{Шляпа Морского Капитана}\n\nЗащищает от негативного воздействия водоворотов.\nПозволяет использовать заклинания Вызвать Корабль и Затопить Корабль, даже не имея Книги магии.\nУвеличивает дальность перемещения героя по морю на 500 единиц",
                "event": "Старый моряк рассказывает вам о волшебной шляпе, которая заставляла его команду работать сверх своих обычных возможностей. Затем он даёт вам потрепанную карту, указывающую её местоположение. После долгих поисков вы находите её под ближайшим камнем. "
            },
            "124": {
                "name": "Шляпа Оратора",
                "description": "{Шляпа Оратора}\n\nПозволяет использовать любые заклинания 5 уровня.",
                "event": "Мимо вас проносится волшебник, удирающий от дракона. Волшебник открывает портал между мирами и прыгает в него, теряя при этом свою шляпу. Дракон следует за ним, после чего портал исчезает. Вы подбираете шляпу, смахиваете пыль и одеваете её."
            },
            "125": {
                "name": "Оковы Войны",
                "description": "{Оковы Войны}\n\nПри использовании этих оков ни вы, ни ваш противник не сможете отступить или сдаться во время боя.",
                "event": "Во время исследования руин древнего города с крепостными стенами вы находите оружие, уничтожившее его - Оковы Войны."
            },
            "126": {
                "name": "Сфера Запрещения",
                "description": "{Сфера Запрещения}\n\nЗапрещает использование любой Магии во время боя вам и вашему противнику.",
                "event": "Вы помогаете крестьянину поймать убежавшую лошадь. В знак благодарности он дарит вам маленький шар. Как только вы дотрагиваетесь до него вы ощущаете, что ваши магические силы покидают вас..."
            },
            "127": {
                "name": "Пузырёк с Кровью Дракона",
                "description": "{Пузырёк с Кровью Дракона}\n\nВсе драконы под Вашим командованием получают +5 к атаке и +5 к защите.",
                "event": "Вы обнаруживаете, что пещера охраняется древним драконом. После лютой битвы вы убиваете его. Предположительно, кровь дракона обладает магическими свойствами, поэтому вы аккуратно собираете кровь в бутылочку."
            },
            "128": {
                "name": "Клинок Армагеддона",
                "description": "{Клинок Армагеддона}\n\nЭтот великий меч дает +3 к атаке, +3 к защите, +6 к знанию, +3 к колдовской силе героя. Добавляет в Вашу книгу заклинание Армагеддона уровня Эксперт. Все союзные существа становятся неуязвимыми для заклинания Армагеддон.",
                "event": "Глубоко под землёй вы обнаруживаете склеп, построенный Древними задолго до эпохи Великого Молчания. Внутри вы находите запертый ларец, на крышке которого начертаны охранительные письмена. Не обращая на них внимания, вы срываете печати. Внутри ларца лежит Клинок Армагеддона."
            },
            "129": {
                "name": "Альянс Ангелов",
                "description": "{Альянс Ангелов}\n\nПовышает все четыре основных параметра героя на 21 балл.  Позволяет смешивать вместе существ добрых и нейтральных рас (Замок, Оплот, Башня, Цитадель, Крепость и Сопряжение) без падения морали.  В начале битвы накладывает на союзных существ заклинание Молитва Экспертого уровня на 50 раундов.",
                "event": "Вы наткнулись на Альянс Ангелов, стряхнули с него пыль и положили в свой ранец."
            },
            "130": {
                "name": "Плащ Короля Нежити",
                "description": "{Плащ Короля Нежити}\n\nЕсли у героя нет навыка Некромантии, то после битвы 30% павших на поле сражения врагов будут восстановлены в виде Скелетов, которые примкнут к вашей армии.\n\nЕсли же у героя уже есть навык Некромантии, то сила навыка увеличивается на дополнительные 30%, а вместо Скелетов из тел павших врагов будут восстановлены:  \nЗомби на Базовом уровне.\nСтражи на Продвинутом уровне.\nЛичи на Экспертном уровне.",
                "event": "Вы наткнулись на Плащ Короля Нежити, стряхнули с него пыль и положили в свой ранец."
            },
            "131": {
                "name": "Эликсир Жизни",
                "description": "{Эликсир Жизни}\n\nВсе существа получают 25% бонус к здоровью и получают способность к регенерации. Не действует на Нежить и Неживых существ.",
                "event": "Вы наткнулись на Эликсир Жизни, стряхнули с него пыль и положили в свой ранец."
            },
            "132": {
                "name": "Доспехи Проклятого",
                "description": "{Доспехи Проклятого}\n\nПовышают Атаку и Защиту героя на 3 балла, а Знания и Колдовскую силу на 1 балл.\nВ начале боя на всю вражескую армию накладываются заклинания Замедление, Проклятие, Слабость и Неудача на 50 раундов.",
                "event": "Вы наткнулись на Доспехи Проклятого, стряхнули с них пыль и положили в свой ранец."
            },
            "133": {
                "name": "Статуя Легиона",
                "description": "{Статуя Легиона}\n\nУвеличивает еженедельный прирост существ во всех городах на 50%.",
                "event": "Вы наткнулись на Статую Легиона, стряхнули с нее пыль и положили в свой ранец."
            },
            "134": {
                "name": "Мощь Отца Драконов",
                "description": "{Мощь Отца Драконов}\n\nПовышает Атаку и Защиту героя на 16 баллов, Колдовскую Силу и Знание на 15 баллов,  Боевой Дух и Удачу на 1 балл. Наделяет вашу армию иммунитетом к магии 1-4 уровня.",
                "event": "Вы наткнулись на Мощь Отца Драконов, стряхнули с нее пыль и положили в свой ранец."
            },
            "135": {
                "name": "Грохот Титана",
                "description": "{Грохот Титана}\n\nПовышает Атаку и Защиту героя на 9 баллов, Колдовскую Силу и Знание на 8 баллов. Герой получает возможность бесплатно использовать заклинание Гром Титанов с уроном в 600 единиц.",
                "event": "Вы наткнулись на Грохот Титана, стряхнули с него пыль и положили в свой ранец."
            },
            "136": {
                "name": "Шляпа Адмирала",
                "description": "{Шляпа Адмирала}\n\nПри посадке и высадке из корабля герой не теряет запас хода. Защищает от негативного воздействия водоворотов. Позволяет использовать заклинания Вызвать Корабль и Затопить Корабль, даже не имея книги магии. Увеличивает дальность передвижения героя по морю на 1500 единиц.",
                "event": "Вы наткнулись на Шляпу Адмирала, стряхнули с нее пыль и положили в свой ранец."
            },
            "137": {
                "name": "Лук Снайпера",
                "description": "{Лук Снайпера}\n\nУвеличивает силу вторичного навыка Меткость на 30%. Позволяет вашим стрелковым отрядам стрелять без штрафов за дальность и препятствия, а также вплотную к врагу.",
                "event": "Вы наткнулись на Лук Снайпера, стряхнули с него пыль и положили в свой ранец."
            },
            "138": {
                "name": "Колодец Волшебника",
                "description": "{Колодец Волшебника}\n\nКаждый день восстанавливает полное количество маны героя.",
                "event": "Вы наткнулись на Колодец Волшебника, стряхнули с него пыль и положили в свой ранец."
            },
            "139": {
                "name": "Кольцо Мага",
                "description": "{Кольцо Мага}\n\nУвеличивает продолжительность всех ваших заклинаний на 50 раундов.",
                "event": "Вы наткнулись на Кольцо Мага, стряхнули с него пыль и положили в свой ранец."
            },
            "140": {
                "name": "Рог изобилия",
                "description": "{Рог Изобилия}\n\nПриносит 4 ед. ртути, серы, кристалов и драгоценных камней каждый день.",
                "event": "Вы наткнулись на Рог изобилия, стряхнули с него пыль и положили в свой ранец."
            },
            "141": {
                "name": "Волшебная Палочка",
                "description": "{Волшебная Палочка}\n\n Позволяет трансформировать артефакты.\n{Слот №1} - Голова и Шея.\n{Слот №2} - Правая и Левая рука.\n{Слот №3} - Правое и Левое кольцо.\n{Слот №4} - Торс и Ноги.\n{Слот №5} - Плечи и Артефакт в слоте №4.",
                "event": "Вы наткнулись на Волшебную Палочку, стряхнули с нее пыль и положили в свой ранец."
            },
            "142": {
                "name": "Золотая Стрела",
                "description": "{Золотая Стрела}\n Дает власть над Стрелковыми Башнями:\n{При атаке:}\n1) Башни не стреляют.\n{При защите:}\n1) Без навыка Баллистики - Башни стреляют 2 раза;\n2) Базовая Баллистика - Башни стреляют 3 раза;\n3) Продвинутая Баллистика - Башни стреляют 4 раза;\n4) Экспертная Баллистика - Башни стреляют 5 раз.\n{При атаке и защите:}\n1) Атакующий не получает бонуса.",
                "event": "Вы наткнулись на Золотую Стрелу, стряхнули с нее пыль и положили в свой ранец."
            },
            "143": {
                "name": "Сила Монстра",
                "description": "{Сила Монстра}\n\nВ начале каждой недели случайным образом выбирает одного из имеющихся монстров в армии героя и накладывает на него заклинание Молитва. Эффект сохраняет действие течении одной недели.",
                "event": "Вы наткнулись на Тавро Силы Монстра, стряхнули с него пыль и положили в свой ранец."
            },
            "144": {
                "name": "-1",
                "description": "-1d"
            },
            "145": {
                "name": "-2",
                "description": "-2d"
            },
            "146": {
                "name": "Топор Сокрушения",
                "description": "{Топор Сокрушения}\n\nПовышает атаку командира на 5 баллов. После каждых 6 выигранных битв дополнительно увеличивает атаку на 1 балл.\n\nПри смерти командира дополнительные бонусы теряются.",
                "event": "Вы подняли тяжелый Топор Сокрушения. Вы уверены, что ваш Командир будет счастливo раздробить несколько голов с его помощью!"
            },
            "147": {
                "name": "Мифрильная Кольчуга",
                "description": "{Мифрильная Кольчуга}\n\nПовышает здоровье командира на 12%.\nПосле каждой выигранной битвы дополнительно увеличивает здоровье на 1%.\n\nПри смерти командира дополнительные бонусы теряются.",
                "event": "Вы подняли сверкающий сверток Мифрильной кольчуги. Этот доспех несомненно продлит жизнь вашему Командиру будучи одетым в битве!"
            },
            "148": {
                "name": "Острейший Меч",
                "description": "{Острейший Меч}\n\nПовышает урон командира на 12%.\nПосле каждой выигранной битвы дополнительно увеличивает урон на 1%.\n\nПри смерти командира дополнительные бонусы теряются.",
                "event": "Вы подняли яркий Острейший Меч. Вы уверены, что вашему Командиру понравится крошить им врагов на кусочки!"
            },
            "149": {
                "name": "Шлем Бессмертия",
                "description": "{Шлем Бессмертия}\n\nОживляет убитого Командира сразу после битвы (бонусы, накопленные артефактами не теряются).",
                "event": "Вы подняли сияющий Шлем Бессмертия. Если ваш Командир оденет его, смерть никогда не заберет его навеки!"
            },
            "150": {
                "name": "Колдовская Подвеска",
                "description": "{Колдовская Подвеска}\n\nПовышает силу командира на 1 балл. \nПосле каждых 10 выигранных битв дополнительно увеличивает силу на 1 балл.\n\nПри смерти командира дополнительные бонусы теряются.",
                "event": "Вы подняли древнюю Колдовскую Подвеску. С этой магической подвеской, Сила вашего Командира будет рости быстрее!"
            },
            "151": {
                "name": "Сапоги Ускорения",
                "description": "{Сапоги Ускорения}\n\nПовышает скорость командира на 1 балл. \nПосле каждых 10 выигранных битв дополнительно увеличивает скорость на 1 балл.\n\nПри смерти командира дополнительные бонусы теряются.",
                "event": "Вы подняли Сапоги Ускорения в отличном состоянии. Эти сапоги несомненно подарят крылья ногам вашего Командира на поле битвы!"
            },
            "152": {
                "name": "Ищущий Лук",
                "description": "{Ищущий Лук}\n\nДает командиру возможность стрелять.\nПосле 5 выигранных битв нет штрафа стрельбы за препятствия.\nПосле 25 выигранных битв нет штрафа стрельбы за дистанцию.\n\nПри смерти командира бонусы за отмену штрафов теряются.",
                "event": "Вы подняли Ищущий Лук высшего качества. При использовании Командиром, обученным стрельбе, дальние дистанции и стены больше не будут препятствиями!"
            },
            "153": {
                "name": "Глаз Дракона",
                "description": "{Глаз Дракона}\n\nНаделяет командира Природой Дракона: возможностью атаковать дыханием дракона и иметь все бонусы драконов.",
                "event": "Вы подняли красивое колечко - Глаз Дракона. Если ваш Командир наденет это кольцо на палец, оно вознаградит его мощью драконов!"
            },
            "154": {
                "name": "Закаленный Щит",
                "description": "{Закаленный Щит}\n\nПовышает защиту командира на 5 баллов. \nПосле каждых 6 выигранных битв дополнительно увеличивает защиту на 1 балл.\n\nПри смерти командира дополнительные бонусы теряются.",
                "event": "Вы подняли Закаленный Щит. С этим отличным щитом, Защита вашего Командира существенно поднимется!"
            },
            "155": {
                "name": "Кольцо Силы",
                "description": "{Кольцо Силы}\n\nУстанавливает все шесть первичных навыка командира на продвинутый уровень.",
                "event": "Вы подняли Кольцо Силы. Чувствуется его мощная магия. Если ваш Командир наденет это кольцо на палец, оно вознаградит его великой мощью!"
            },
            "156": {
                "name": "Знамя Полководца",
                "description": "{Знамя Полководца}\n\nКогда включен опыт армий, Знамя Полководца дает дополнительные бонусы в битве. Чтобы его использовать, перенесите его на один из отрядов ваших солдат.\n\nВыберите бонус, правым кликом по Знамени в окне опыта армии. Вы можете изменить бонус в любое время, кроме момента битвы.",
                "event": "Вы подняли Знамя Полководца. Если вы отдадите этот артефакт вашим солдатам, это может привести их к победе!!"
            },
            "157": {
                "name": "Багровый Щит Возмездия",
                "description": "{Багровый Щит Возмездия}\n\nУвеличивает защиту героя на 2 балла и дает всем существам в армии героя способность отвечать на атаки тех, кому обычно не отвечают на атаку.",
                "event": "Надевая Багровый Щит Возмездия, вы заметили появление непоколебимой решимости на лицах ваших солдат, и теперь вы знаете, что они всегда смогут ответить кровью за кровь в пылу сражения."
            },
            "158": {
                "name": "Топор Свирепости Лорда Варваров",
                "description": "{Топор Свирепости Лорда Варваров}\n\nПовышает Атаку и Защиту героя на 4 балла, а Колдовскую Силу и Знание на 3 балла. Дает всем рукопашным отрядам в армии героя дополнительный удар в каждой атаке. Стрелки не имеют данного бонуса.",
                "event": "Вы подняли Топор Свирепости Лорда Варваров и его голос проник в ваш разум, \"Приведи врагов и вместе мы вырубим просеку сквозь их легионы!\" "
            },
            "159": {
                "name": "Сердце Дракона",
                "description": "{Сердце Дракона}\n\nЭтот древний реликт случайным образом призывает драконов в вашу армию на время битвы. Общий запас здоровья призываемых драконов равен уровню героя * 100. Все драконы в армии героя всегда имеют хороший Боевой Дух.",
                "event": "Вы подняли Сердце Дракона и почувствовали барабанный бой десяти тысяч драконих сердец, звучащий в вашей душе. Когда вам будет нужно, драконы придут."
            },
            "160": {
                "name": "Ключ Врат",
                "description": "{Ключ Врат}\n\nПри входе в любой из ваших городов, Ключ Врат даст вам возможность закрыть его на 5 дней. Герои могут покинуть закрытые города, но ни один герой не может попасть в город кроме как через Портал Города. Город не может быть атакован.\n\nКлюч Врат исчезнет после использования и вернется к герою спустя 10 дней. Город не может быть заново закрыт ни одним Ключем Врат в течении 5 дней после открытия. Если игрок побежден, его закрытые города будут открыты для всех игроков на следующий день.",
                "event": "Вы подняли Ключ Врат. С этим невероятно редким предметом, вы сможете заколдовать ворота вашего замка, чтобы не пропустить ни одного, даже самого мощного из ваших врагов!"
            },
            "161": {
                "name": "Шлем #161",
                "description": "{Шлем (Артефакт #161)}\n\nЭтот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM.",
                "event": "Вы подняли шлем: Артефакт #161. Этот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM."
            },
            "162": {
                "name": "Меч #162",
                "description": "{Меч (Артефакт #162)}\n\nЭтот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM.",
                "event": "Вы подняли Меч: Артефакт #162. Этот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM."
            },
            "163": {
                "name": "Щит #163",
                "description": "{Щит (Артефакт #163)}\n\nЭтот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM.",
                "event": "Вы подняли Щит: Артефакт #163. Этот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM."
            },
            "164": {
                "name": "Витое Кольцо #164",
                "description": "{Витое Кольцо (Артефакт #164)}\n\nЭтот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM.",
                "event": "Вы подняли Витое Кольцо: Артефакт #164. Этот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM."
            },
            "165": {
                "name": "Кольцо 3х камней #165",
                "description": "{Кольцо 3х камней (Артефакт #165)}\n\nЭтот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM.",
                "event": "Вы подняли Кольцо 3х камней: Артефакт #165. Этот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM."
            },
            "166": {
                "name": "Широкое Ожерелье #166",
                "description": "{Широкое Ожерелье (Артефакт #166)}\n\nЭтот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM.",
                "event": "Вы подняли Широкое Ожерелье: Артефакт #166. Этот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM."
            },
            "167": {
                "name": "Броня #167",
                "description": "{Броня (Артефакт #167)}\n\nЭтот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM.",
                "event": "Вы подняли Броню: Артефакт #167. Этот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM."
            },
            "168": {
                "name": "Мантия #168",
                "description": "{Мантия (Артефакт #168)}\n\nЭтот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM.",
                "event": "Вы подняли Мантию: Артефакт #168. Этот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM."
            },
            "169": {
                "name": "Ботинки #169",
                "description": "{Ботинки (Артефакт #169)}\n\nЭтот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM.",
                "event": "Вы подняли Ботинки: Артефакт #169. Этот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM."
            },
            "170": {
                "name": "Рог #170",
                "description": "{Рог (Артефакт #170)}\n\nЭтот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM.",
                "event": "Вы подняли Рог: Артефакт #170. Этот артефакт {ПУСТОЙ} и может быть запрограммирован с помощью ERM."
            }
        }
    }
}