{
	"srm": {
		"main": {
			"can_learn": "{Spell research}\n\nA spell is available (heroes may learn it)",
			"cant_learn": "{Spell research}\n\nA spell is available (heroes may not learn it yet)",
			"can_research_for_pay": "This spell can be replaced at a price",
			"or_complete_it_for_free": "You may select another spell at a price, or end the research for free",
			"two_rsrchs_frbdn": "You can't research two spells at a time",
			"this_turn_was_research": "Research has already been done this turn",
			"available": "Research is possible",
			"no_resources": "Insufficient resources",
			"can_buy": "To cast spells, your hero must first buy a spell book for @cost@ gold. Do you wish to buy one?",
			"cant_buy": "To cast spells, your hero must first buy a spell book for @cost@ gold. Unfortunately, you seem to be a little short of cash at the moment."
		},
		"hints": {
			"do_research": "@spellName@ (click to commence research)",
			"is_researched": "@spellName@ (permanent)",
			"was_researching": "@spellName@ (research has already been done this turn)",
			"another_researh": "@spellName@ (another research is currently underway)",
			"is_researching": "Research is underway (current spell is @spellName@)",
			"no_resources": "@spellName@ (insufficient resources for research)",
			"pay_and_start": "Pay and commence research",
			"pay_and_continue": "Pay and continue research",
			"complete_for_free": "End the research (free)",
			"cancel": "Cancel",
			"leave_mg": "Exit Mage Guild"
		},
		"scroll_texts": {
			"cant_change": "{@spellName@}\n\nYou may not replace this spell.",
			"can_change": "{@spellName@}\n\nThis spell can be replaced at a price. It is currently available for learning.",
			"rolled_scroll": "{Spell research}\n\nThis spell can be replaced at a price. It is currently not available for learning. You may end the research, making this spell permanent in the slot.\n\nCurrent spell is "
		},
		"spell_choice": {
			"head": "Select a spell",
			"head_one_spell": "New spell",
			"accept_hint": "End the research",
			"decline_hint": "Confirm without ending research"
		},
		"help": {
			"head": "{Introducing the spell research mechanic.\n\n}",
			"body": "{~text align=left}It’s now possible to carry out research in the Mage Guild screen, replacing spells in the slots.\n\nThe cost is (2*spell level) of {~>SMALRES.def:1}, {~>SMALRES.def:3}, {~>SMALRES.def:4}, {~>SMALRES.def:5}, and 1000 {~>SMALRES.def:6}. Research is limited to one per day, per town (doesn’t prevent construction).\n\nThe research removes the old spell from the slot and offers a choice of two random new spells ({one new spell at level 5, no choice}). It’s possible to do further research in the same spell slot, but the heroes won’t be able to learn the spell until the research is finalized. New spells will be generated according to the base certainty value by town type. Old spells (that ones that were in town or were not chosen after research) won’t be generated again before every potential new one is cycled through.\nYou may finalize the research at any point. From that point your heroes will be able to learn the spell you selected, but the spell slot will become permanent.\nA town’s mandatory spells can’t be replaced. Only one instance of research may be carried out in a town at any time. You’ll have to finalize the research before working on a different spell slot.}",
			"ask": "\n\nDo you want to see available spells to be researched in that mage Guild?\n\n(You can see that list by Right-clicking on {~>icm005.def:0} button)",
			"info": "\n\nPress {~>icm005.def:0} button to getting more info",
			"endl": "\n",
			"levelSpellsHead": "{You can research the following spells}\n",
			"levelSpells": "{On level @guild@:}\n"
		}
	}
}