{
    "RMG": {
        "objectGeneration": {
            "35": {
                "1": {
                    "name": "Форт на холме"
                }
            },
            "141": {
                "0": {
                    "name": "Толкователь Снов",
                    "text": {
                        "hint": "(+500 опыта за каждый посещённый объект один раз для каждого героя)",
                        "visit": "\n\nВы садитесь перед Толкователем Снов, закрываете глаза и внезапно оказываетесь в комнате с книжными полками вдоль каждой стены. Дверей нет! Кажется, что в течение нескольких дней фигура в плаще раскрывает секреты этих многочисленных книг. Вы просыпаетесь и обнаруживаете, что прошло всего несколько секунд!",
                        "visited": "\n\nВы садитесь перед Толкователем Снов, но не можете заснуть. Возможно, вы уже узнали все, чему он может научить."
                    }
                },
                "1": {
                    "name": "Могила",
                    "text": {
                        "visit": "\n\nЭта могила свежая, и даже лопату, которой её рыли, никто не успел унести. Чтобы добраться до сокровищ, потребуется целый день раскопок.",
                        "visited": "\n\nЭта могила свежая, и даже лопату, которой её рыли, никто не успел унести. Воспользовавшись ей и завязав платком нос, вы извлекаете из земли кое-что ценное."
                    }
                }
            },
            "144": {
                "0": {
                    "name": "Храм Лояльности",
                    "text": {
                        "hint": "(Устранение падения боевого духа из-за различия фракций до следующего хода)",
                        "visit": "\n\nВы молитесь в необычном храме и чувствуете, как под влиянием его атмосферы ваше войско становится более сплочённым.",
                        "visited": "\n\nМолитва в Храме Лояльности помогает сплотить войско перед битвой, однако ваша армия и так действует как единое целое."
                    }
                },
                "1": {
                    "name": "Преобразователь Скелетов"
                },
                "2": {
                    "name": "Колизей Магов",
                    "text": {
                        "hint": "(+2 к силе магии или знанию один раз для каждого героя)",
                        "visit": "\n\nВ Колизее сегодня показательные выступления. Вы выходите на арену и приводите публику в восторг демонстрацией своих колдовских талантов. В качестве приза вам предлагают одно из новейших учебных пособий - истинный маг должен идти в ногу с достижениями науки.",
                        "visited": "\n\nРаспорядитель Колизея, узнав вас, раскланивается, но на арену пускать не спешит. \"Ваше место не среди соискателей, а в судейской ложе!\""
                    }
                },
                "3": {
                    "name": "Водопой",
                    "text": {
                        "hint": "(+1000 к передвижению на следующий день за весь текущий его запас)",
                        "visit": "\n\nОтличное место, чтобы устроить привал и завтра с новыми силами ринуться на поиск приключений. Хотите встать здесь лагерем?",
                        "visited": "\n\nВоины уже расположились на привал. Вряд ли удастся до завтра поднять их в строй."
                    }
                },
                "4": {
                    "name": "Минеральный Источник",
                    "text": {
                        "hint": "(+1 к удаче до следующего боя и +600 к передвижению на 1 день)",
                        "visit": "\n\nЛошади пьют солоноватую воду из источника неохотно, но вскоре вы видите, что сил у скакунов явно прибавилось. В брызгах воды над пузырящимся источником появляется весёлая радуга, что приводит ваш отряд в отличное настроение.",
                        "visited": "\n\nЖивоты людей и солдат булькают от выпитой воды. На сегодня целебных процедур достаточно."
                    }
                },
                "5": {
                    "name": "Лачуга Отшельника",
                    "text": {
                        "hint": "(Улучшение случайного вторичного навыка один раз для каждого героя)",
                        "cannotVisit": "\n\nЗайдя в лачугу, вы обнаруживаете, что хозяина дома нет, а вот стены обклеены страницами из научных книг. Пособия интересные, но сложные - сначала придётся где-нибудь почитать учебник для начинающих.",
                        "visit": "\n\nЗайдя в лачугу, вы обнаруживаете, что хозяина дома нет, а вот стены обклеены страницами из научных книг. В углу возле очага вам удаётся вычитать кое-что полезное.",
                        "visited": "\n\nЗайдя в лачугу, вы обнаруживаете, что ремонта с момента вашего предыдущего визита тут не делали, и на стенах всё те же знакомые манускрипты."
                    }
                },
                "7": {
                    "name": "Старьёвщик"
                },
                "11": {
                    "name": "Проводник",
                    "text": {
                        "hint": "(Уменьшает цену обычного шага по пустошам до 75 ед. до конца недели)",
                        "visit": "\n\n\"Я знаю эти пустоши как свои пять пальцев. Даже если я где-то еще не был - разберусь, как найти дорогу. Пожалуй, я могу на недельку отправиться с вами, если вам нужен проводник.\", - говорит обитатель этого шатра.",
                        "visited": "\n\n\"Эй, это же мой шатер. Заметьте, это не по моей вине мы ходим кругами\", - качает головой проводник."
                    }
                }
            },
            "145": {
                "0": {
                    "name": "Древняя Лампа",
                    "text": {
                        "hint": "(Доступные существа: %s - {%d})",
                        "visit": "\n\nИз лампы выглядывает джинн в мягкой чалме. \"Что, опять наниматели? А деньги у вас есть? Бесплатно не работаем, желаний не исполняем. Всё остальное - как полагается\"."
                    }
                }
            },
            "146": {
                "1": {
                    "name": "Обсерватория",
                    "text": {
                        "hint": "(+2 к радиусу обзора до конца недели)",
                        "visit": "\n\nАстроном просит вас взять с собой его ученика. Юноша засиделся в башне, а вам могут пригодиться его навыки в обращении с подзорной трубой. Но через неделю астроном проводит важные наблюдения, и ученик понадобится ему самому.",
                        "visited": "\n\nАстронома нет на месте. На двери обсерватории записка: \"буду через неделю\"."
                    }
                }
            }
        },
        "notImplemented": {
            "144": {
                "8": {
                    "name": "Скважина",
                    "text": {
                        "visit": "\n\nБуровой мастер выкатывает тележку с ценностями. \"Мы выгодно продали добытое. Надеюсь, следующий раз получится не меньше - приезжайте за своей долей через неделю\".",
                        "visited": "\n\nБуровой мастер очень занят, из его бурчания вы понимаете, что пока порадовать вас ему нечем. Надо будет заехать на следующей неделе."
                    }
                },
                "9": {
                    "name": "Лаборатория Чернокнижника"
                },
                "10": {
                    "name": "Старатель",
                    "text": {
                        "visit": "\n\nУсталый старатель смотрит с вызовом, но заметно, что он вас всё-таки побаивается. За разрешение продолжать добычу в этом месте он готов регулярно платить вам небольшую сумму.",
                        "visited": "\n\nСтаратель то ругается на истощенную жилу, то причитает и умоляет. Очевидно, на этой неделе от него больше ничего не добиться."
                    }
                }
            },
            "145": {

            }
        }
    }
}